;;; pinyinlib.el --- Convert first letter of Pinyin to Simplified/Traditional Chinese characters  -*- lexical-binding: t; -*-

;; Copyright (C) 2016  Junpeng Qiu

;; Author: Junpeng Qiu <qjpchmail@gmail.com>
;; Keywords: extensions

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;;                              ______________

;;                               PINYINLIB.EL

;;                               Junpeng Qiu
;;                              ______________


;; Table of Contents
;; _________________

;; 1 Functions
;; .. 1.1 `pinyinlib-build-regexp-char'
;; .. 1.2 `pinyinlib-build-regexp-string'
;; 2 Packages that Use This Library
;; 3 Acknowledgment
;; 4 Contribute


;; [[file:https://melpa.org/packages/pinyinlib-badge.svg]]
;; [[file:https://stable.melpa.org/packages/pinyinlib-badge.svg]]

;; Library for converting first letter of Pinyin to Simplified/Traditional
;; Chinese characters.


;; [[file:https://melpa.org/packages/pinyinlib-badge.svg]]
;; https://melpa.org/#/pinyinlib

;; [[file:https://stable.melpa.org/packages/pinyinlib-badge.svg]]
;; https://stable.melpa.org/#/pinyinlib


;; 1 Functions
;; ===========

;; 1.1 `pinyinlib-build-regexp-char'
;; ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

;;   `pinyinlib-build-regexp-char' converts a letter to a regular
;;   expression containing all the Chinese characters whose pinyins start
;;   with the letter.  It accepts five parameters:
;;   ,----
;;   | char &optional no-punc-p tranditional-p only-chinese-p mixed-p
;;   `----

;;   The first parameter `char' is the letter to be converted.  The latter
;;   four parameters are optional.
;;   - If `no-punc-p' is `t': it will not convert English punctuations to
;;     Chinese punctuations.

;;   - If `traditional-p' is `t': traditional Chinese characters are used
;;     instead of simplified Chinese characters.

;;   - If `only-chinese-p' is `t': the resulting regular expression doesn't
;;     contain the English letter `char'.

;;   - If `mixed-p' is `t': the resulting regular expression will mix
;;     traditional and simplified Chinese characters. This parameter will take
;;     precedence over `traditional-p'.

;;   When converting English punctuactions to Chinese/English punctuations,
;;   it uses the following table:
;;    English Punctuation  Chinese & English Punctuations 
;;   -----------------------------------------------------
;;    .                    。.                            
;;    ,                    ，,                            
;;    ?                    ？?                            
;;    :                    ：:                            
;;    !                    ！!                            
;;    ;                    ；;                            
;;    \\                   、\\                           
;;    (                    （(                            
;;    )                    ）)                            
;;    <                    《<                            
;;    >                    》>                            
;;    ~                    ～~                            
;;    '                    ‘’「」'                      
;;    "                    “”『』\"                     
;;    *                    ×*                            
;;    $                    ￥$                            


;; 1.2 `pinyinlib-build-regexp-string'
;; ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

;;   It is same as `pinyinlib-build-regexp-char', except that its first
;;   parameter is a string so that it can convert a sequence of letters to
;;   a regular expression.


;; 2 Packages that Use This Library
;; ================================

;;   - [ace-pinyin]
;;   - [evil-find-char-pinyin]
;;   - [find-by-pinyin-dired]
;;   - [pinyin-search]


;; [ace-pinyin] https://github.com/cute-jumper/ace-pinyin

;; [evil-find-char-pinyin]
;; https://github.com/cute-jumper/evil-find-char-pinyin

;; [find-by-pinyin-dired]
;; https://github.com/redguardtoo/find-by-pinyin-dired

;; [pinyin-search] https://github.com/xuchunyang/pinyin-search.el


;; 3 Acknowledgment
;; ================

;;   - The ASCII char to Chinese character
;;     table(`pinyinlib--simplified-char-table' in code) is from
;;     [https://github.com/redguardtoo/find-by-pinyin-dired].
;;   - @erstern adds the table for traditional Chinese characters.


;; 4 Contribute
;; ============

;;   Contributions are always welcome.  If you want to add some common
;;   pinyin related functions that might be useful for other packages,
;;   please send me a PR.

;;; Code:

;;; DICT STARTS HERE
(defconst pinyinlib--simplified-char-table '(
  "鹌拗垵闇薁凹嬡安碍袄嗳吖媪聱爱翺曖黯敖桉騃腌硋奥岸媕嶅厂氨呆暧垇俺按嗌岙矮硙鵪枊謷呵隞鳌皑厫肮遨靉毐菴璦卬广蔼阿翱哎懊铵锕庵嫒盎揞熬抝晻暗谙藹腤哀傲愛案锿啊犴埯鼇砹嚣薆叆埃霭挨奡艾慠獒坳癌嗷骜隘礙廒璈螯唵襖娭盦噯爊隩唉昂欸骯鏊鏖瑷皚鞌嗄捱嶴鞍胺澳"
  "孛被镳八飈蛃啵坂犇萹膀羓蘖鞭駁愎茇苞摆鞞蔽補艑豝埔蹦叭颁儦鯾诐髆鲾傍柄妣鞛匾擺梆拔炮唄揹煏贬刨坌鱍版滮饆皀迸荜昺办悲渤亳鄙边邲搒躃惫龅弻祊孢奰鲍閟丙蜯笆般綁襬比獘本保鑤辮哱愊膊贲雹陂阪邦塝倴並碥潷灞祕镖邶萆背半艴牓舨甏梐摈绷蹕癿馝鞴苄镔薄不搏苯缽捌步蚌坝饽踣湢邠濞彼脿庯鑌浡俻幫铋摒缏粑朳咇舶饼掰蔀腷滨鳔鹁虣拜褊逼扳伯裨褒猋膘笾卑襮簿柈濒偪僰筆艕焙甭檗篦殯宾泌杯哺币癟斑表馎闆彆宝佰鐾畢弼蝙钣碑玻辫熛舭鵏卟鉋白婊钚飽捕必蚆巴峇岜鼥檳呗弁变瘪毕稖膑粃剝爸誖耙盋崩湴磅豹擘變包鬢髀壁荸梖濱铂碧稟蔔婢驳豳禀埗怖哔摽邊閉鲃晡緥椑狈覇別狴峬跸砵襃筚佈辯畀拌芭槟飇袯菶窆攽臂抱吡陛髩鳖昪骉菢北襏庇播镚砭繃玤憋蓓培餔绑笔藨逋褓韛觱钡稨繽秉帛蝂靶賔报曝辟夯并幖暴扁錶锛泊瀑惼竝榜敗屄伴镑吥布钵鸨璧霸便板髈蔈琲夿蒡笓疤炳罷貝扒罢钯汴躄败昞菝襞弊浜痹秘標堡毖瓣邴嬖胈跛冰蹩頒捭獙斌奔贝飙卜部儐瘢棒醭佊埠髌屏憊倂搬嘣薜欛飑趵畚埲擯坢靽箔馞輩辨藊缤壩编穮礴辦皕傧苾波珌睥鹎蕃報菠跋簸坒氷赑抃百瓿斃欂沘簙谤褙秕桲寶徧鼻兵魃蓽餅栢芘饱逩扮玢篳避鵖坋辈绊嗶博昄葆柏胞裱杓撥髕鲌琫吧笨糒骠彪編镈籩备把鬓寳賓瀌箅闭卞帮髲妭嶓悖钹栟遍标臏煲痺臕鼈癍魄匕脖棓煸剥倍稗别勃泵滗蓖补病鳊敝枹拂庳拨駮碚狽駜殡毙幣鞁盃瘭辩佖爆備桮鲅彬忭班篰梹俾俵"
  "恻財螬琮腠斮慘梣瑽悰掺滄側汆黪啐材毳跐邨從参囪噌蹲粗彩蒼鑹漼麁仓祠倸攒此慙册筞湊簇倅筴攛蹵催嘈蔟采殘蓯飡測词猜财层剒悤刺吋棤痤漕菜踆聪磁茈锉趣焠嶒獕麤苁礤蔡淙摧操促慈甆縩詞踧沧艙綵湌跴賨蚕廁糙曾骢刌瓷淬藂缞存瘁测觕侧疵惭剉脆拆糍篸莝凑鏦蹉懆睬纔艸枞聰餈囱辤伧堲辭瑳層擦冊丛膵厝皴苍蹙蹿兹厕躥槽薋葱燦辞鹚嵯璨騲爨雌萃差舱璀翠匆寸蹭徂熜错顇醋崔撮叢涔錯傖搓策黲泚矬玼憱悴酢骖从挫撺脞酂残綷寀村憯採鹺衰竄肏次磋佽摻篡粲樷殂茨猝赐參驂璁镩樅鮆藏鸧呲脃瘥鹾粹餐怱曹脺草伺才孱埰偲蔥穇鶬欑蠶措卒踩倉灿裁莿慚岑辏絘艚蹴榱忖窜嚓惨"
  "墮頓擋禫萣靛断狄跺調凼筜締到督燾跢蹬独定蚪朵帱儋巅碟蓧铥笃掉唙岛打谛黩礅禱鐸惰舠珰呆咄揲妲炖儅碫裆疊燉町傎柮嘚夺錞舵垛堵跕啖嗲迨懂棟岱淡嵽氐祋倒鼕殜氘订淀躲怼竇襠箪汏黱犢遯钝緞蹀點诞囤癫鲽甔屌擣椆凋脦道蹾襶毒敌端襌咑傣贷膻碡鶇撉剟痘扽导蔸櫝甸芏阇郸嚲跌讜璒哒睹殚待釣掇丁蕩侗癜盪隄玓肚蒂電递攧叮岽篼單钉帝鍍顶廸逮点答堕底妒大鬭滌盯繨靼冻鞮亸垯蹲槑溚獨瞪蝃達凟鞑典滴髑靪汈隊砥瑖迭躉耋啗妬玎韃店锭颠绦鼎渎丟搭眈宕对锝撴驐簖碘氡塅窦憚的歹琱塔碉鎝糴蠹垱抖丹绐彫跥叨鸟簦黨豆籴黷登镝昳哆鵰吨炸軃擔啶党盾铞恫蝀酊德睇讟頔遁矴叇觝兜仃鍛瘅瀆刁虰敚电提嚪煅踶噹蜨垌堤澹石島殫剁鐺铛斗渡骶墊东黕甙耼疍楪担盗档犊逗褝祷爹曡嶝玷绖钿埭壋獃鼦俤鬥帶嘀牒堞邓簹枓荳跶鸫噔阘谍鱽荡佃訂骀堆带螙鄲玳籪沓靆垈垤貂董蜑钓怠悼磴脰疸菂碓戴奠怛铫读兑队誕多埵嘟朶奪代敁铎奲镫饳噸唗椗哚旦遞蹈琔诋櫈搗鄧镦導凙杜當噉洞第敠掂耷疔踮讀棣赌鲷働坻髧亶磾椟氹躭澱段嶌噠地羝攩薘惦锻對簞轪赕驮敪瘩碇殆黛覩呔耑捯弟茋垫得都咚等酘谠栋撢蝶硐賭懟弔低捣荻耵忉荙惮抵螮崬但坫躱单笪殿匵胆饤墬胨阧窎璫叠敵鬦撣彈樀鬬氮掸笛憝萏瑇椴纛垜短踱伄峒冬錠瓞调腖簟髢碭钭嗒弹覿达丢蹢東頂腚憺褡燈滇稻凍刀涤叼裰雕牴铤墩迪焘柢牍吊盹媂膽戥觌釘癉沌鿎饾挡澄耽刴娣惇碲禘翟炟镀柁缎聃厾砘顿斷嫡度杕当袋贉扂阽动陡楯蝳凳鳥菪蛋趸喋荅惪缔胴砀動蠧灯邸幬顛蔕敦牘盜檔墶"
  "誒贰噩譌鳄吪轭鲕鵝頞陑爾鹗奀饿铒二饵齶工戹痾兒蚵恩尔嗯哦呃苊呝鵞摁锷搤娿阨胹愕鱷佴邇蒽峨阿婀咡額鄂崿莪屙俄娥輀厄洏餓扼堊讹额噁洱恶耳儿迩姶皒谔涐峩鞥锇而遏惡阏弍鹅颚垩腭欸鸸诶珥萼囮耏蛾堨刵"
  "废乶钫鳳凫灋法舫縛蠭洑費垡锋縫坊饭奋罘倣腹砆翻菔豮奮閥烽朆蝜髣赋畈頫颿服淝呋麸篚俸阀扉旛棻付氾紡鄜彿釜辅茯煩汾甫芣幅鲼複鈇否鲋份瞓匐腓弗赴憤苻艴吠肥蝠罸偾氟钒蚡妇市疯箙氛脯辐伐赗祓蝮幞黻諷愤肺朏芬負夫方矾芳襆俛缝俘瘋忿腑绯鳆福範雰泛榑廢瀵趺反珐飯孵枋販鬴枫沸蚄腐讣甮咐逢鲂幡婦坿讽豐蜉赙輻傅镄符风砩蹯膚纺髮蜚房烦帆宓痡富芙鳯鮄刜飛府孚砝墳伏菲罰焚緐榧騑葑桴璠燔筏跗復唪馥鲱访父韍拊滏番怫礬彷莩昉覆崶袱灃痱茀祔蜂飞复撫酚棼芾妃附風绂凢翡棐稃汎粪柎鋒鷭俯缚范仿费覅墦敷诽郛酆髴悱琈罚肤驸垺翂匪糞粉负紛阜霏韨蕃簠缶贩妨栿放返訪牥浮狒嬎繙罦乏覂沨伕醱发防涪鴔斐鼢玢肪浲黼坋抚疿蘩丰凤剕啡峰輔副峯非扶撨琺吩膰纷分犯砜凡佛玞樊鳧斧奉沣冯绋封枹拂鵩蚨犎梵坟發酦藩邡繁"
  "鸹管鉤荄姽槀溉戈媯聝雊綱虼尴刚戛贡垙价搞渦衮蟈臯館股搿鈣琯棡坩膕矼槼廆沽蒄咯稾瓘玍梏鹒劌缑个牿鲧匮剐鳏絓榖鬲擀旮糕广骨颈规耇庪家圪秆扞甘虢铬狗鸽戆坬辊夬膈箍颳淦刮哥蛊蛄爟屹哽勾鋼冈伽彀公犷酐哿咼幹矜尜炔纶汩鬼騧埚夠鹄虷慣鍋獷菰涡辜骾冠卦匦掆瘝宄蜾乾関睪搆缸诖彍攻镐鹘贾轕括聒擱槓疳過呙瑰澉嗝傀孤嘏陔梗佝詭規涫該磙纲灌更謌归櫜蓋顾丱滾郭绀汞邽鳜柑桄歌皋弓观罆格罡桧盥個钢岣闺界垢尲该鲠胍贵珙緪棺舘仡彉筻稈苟耕榦巩镉盖鲴果觚趕榾国袞蚣珪觏泔僱堩赣艮谷宫鳡錧葛癸痼箇躬莞罐酤钩鞲暠瞽忓埂钴亘贯漍桿尕剛牯睾馘毂胳钙锆红隑共顧崗罛嘎妫轨槨貴瀔玕怪橰赶革綸关诂陒浭肱咖佹耿皈輨堌姑臌剮嬀唝晷根固氿纥構匄刿痯塨槁觥椁摑柺炅杲鹳龚菓躳毌苷杆告緺桂觀故國鿍逛鬶貫貢构概高槔锢頸帼宮罣拐橄缟羹掴港餻購遘鞏柜溝棍丐竿鲑乖篝鈷苽馉割笴藁赓肛刽珖歸给鴿跪崮洸釭笱刈扛簋圭寡枸钆倌疙尬囯饹塥膏庚馃垝郜估鱥給關硔敢戤筦跟灨雇岗旰瓜轱鸪罟堽檜栱官功粿咣菇拱茛櫃筶工肐古夾购廣各亙蝈龔冓芥够晐颌供绲龟篙硅崞幗姤贑筀搁鮌句改滚蓇呱芶暅绠茖袼冮蛤耈褂縆惯掼夹堝轧穀瓌骭呷庋腘裹间盬合岡诰矸鳤媾舸滆掛鼓咕蠱恠羖祼閨过光羔畊絚馆诟阁干胱骼赅隔肝尷閤劀诡軌锅噶稿杠硌哏栝垓恭龜軱劊挂沟感"
  "乎耠鉷垾圂喙魟虎镮好咴洪潓皝颔騞鹖颢恚虾讙澒豢麾翽熇惶阂鐄隺吽恍狐蘅诨濊浬活呼害癀佪喚卉撝滑绘袆琥蝗鬟蠖鹱蠔阓盒灰会溷怙徨哼瀚踝穢幌翙横譁鱟歡辉黌护翃唿斛煳浍澴幠葓鲎紅獲啈曷塃湟翮恆轷扞圜喊晃嚎搰黉鈜虹號汇旱函戯噑焕笏亥锾霍囬鄠嘩蔊渾欢衡暵貉诲很晖隍憾嚆惚户诃赫環鳠姮喉双喝豗贿嚄岵桦鹄虷沪烠賀奐榥薈戶謊鹕画畫盇皓觟堕惛燴缳槵洄諱邯祜侯薅鹘镐晗筕滉弧瑝唤恨灏壺或峘驊橞喤换夥何桓遑哗潢猾黄轰沍釬缋訸囘迴皜堼获隳華阖馄伙噦绗砉嫿毀轟饸堠哈鹮硊荷胲惑燬闳薨菏怀诙涣桧海憨互厚戲漢荤奂环酣痪缓訶揮糊槐輝颃猢惠行焊昊祸漷盉蛔彟禍毁僡耲咍汉黃韓幻簧凰郃暠浛澮蝴匯冱铧挥換滬鏵骇漶會阚嗥红唬溃晦枑擐蟥盍嬛繪毫患護藿怳嗬篁荁穫嵅吭澣戽阍玒琀殨郇蝦捍嚾攉猴嘑虺翰昏湖逅铪黑觳豪貛竑核戏恒货睆贺澔銲浑唝廻醐纥夯滙磺鳇鹤雚珩迒蕻沆轘熯婳縠譭橫镬徽含撼还翯吰岾餱郝褐碈咳槥垎囫覈緩龁鲘嗐訇貨慧噷回獾骅後懷醢候臛化韩谼蚶哕欱徊佫瓛火還阛蕙蔧糇慁鲩嚇魂钬逭蒿鬨蟪洹纮豞鼾脝餬鬍淏慌骺鸿肓锪浣淮郈靧鸻璜皞涵衚吼貆硔浩瓠豁佸圅谎奤揈憓狠河嫭桁檜悔胡壕嚯讧壑菡悍锽瘊荒槲劾吓搳嘿淴齁杭忽話和烀划孩巷汗唅龢颌鄗彙泓呵篌寰蛕滈瑚萑濠涸花樺婚睅痕劃氦褘号华剨驩崡昒蚘罕蚝楛珲垕宏顸篲嗨壞蛤嘒皇壶蠚坏后话懽鞨犴荟合混扈烩耗荭撖昈篊媓骸彗劐葫恢闬煇茴哄烘焓航浒煌宦秽滹讳閤弘寒亨艎睺翚禾邗濩"
  "衩痴瀍呎沖梣蠢筹蒭螭车噌婵帱噇琡瑒镵鹑虿纏杵塵畅竾匙厂侈櫥牎瘈磣儲臣稠倕承罿蠆传菖椎庱叉窻歘讎宠錞炒铖畴鲿茶搊撐逴謿拆嵖瞠儳斶赪檉翄嗤疢酬禅阊骣澂綝牚趁产喘丑称椆浐籌碜醇窗斥裎耖秤砗箎酲蹰串镲绸艟船勦辵崇抄剎揣椿忏姹唱穿陳倘敕闖倀儕雠娖韔椽孱箠長亍猹啴憕铲抶踹楮牕酧樗諔蟾單偿潮捵乘躔蹅處馳愴誠谶蟲抻掺础叱谌鶉剙捶锤耡躊鼂哧刹觸炽純処殠诚初澶程踸闡橙舩窓墀惆詫堾遲啻嬋瞋濋旾剿呈茬羼巢閦莼绰怵晨嫦魑廠廛苌尘涌刬橱缀腸黜惷遄榇啜鶵滁鶒歠茝撑晁伧珹雏齿川陲谄蚩辰辍槎裳偁铳牀懲俦蟶喳缠詧镡持柽搽肠鲳蛏傖僝凔讒出棰侪柴嘲吃查鉏楚鎚伡堘梴韂处厨冲馇嘗盛弛傳綢娼抽钞吹鋤裯寵鈔沉锸悵懺踳鐺铛玚眵枨硶齒驰辴雛產察瘛舛诧臿龊憷暢丞儭稱逞瑃琛饞茺趂宬惝胣嚫幮常齼嘽沈塍怆踌疮颤偢厰囅篘瘳豉长奼绌償蝽褚蝉褫敞臭脣搥嗔産襯舡忱搀瞅扯瘡膗婤徹煁衬超檫吵晟齣膪馋踔撤錘仇珫嚐充床差訦憧杻圌郴摏忡珵憃楂熾汊淳舂癡尝俶刍坻愁醜鋹掣鏟剗怊篨車櫬成虫徜礎岔摴撦躇翀攙鸱欻重柷呫彻搐创旵迟弨廚躕池蜍巉宸惩纯萇輴漴艖陈儔倡辿除怅蓴鬯豺单埕戳僢昌阐垞醻痓篅矗焯饬朝塲插锄絺勑槌扠坼伥钗唇茌瓻潺棽惙媸种婼篪胵搋幢犨龀城彳衝剷耻谗畜趻歜漘芻氚炊储蟬笞猖禪場顫漦郕黐讐澄唓触滻觇冁喫摻昶尺碴剏翅鋋氅钏摛瘥骋侴场杈創春棖侘蒇襜垂嘬闯踟勅琤幬椉疇傺澈赤恥滀埫嚓"
  "疾耩畸僅俱計堦珈劼枅将戬楫睑积圾舰莖期懼竭劔车碁姣虡減莙教犋馂径击戛趄槛瞷膙竟价擧铗寂届窖镜岊驾谨跻攫啾今就裥璬雞炯疽鰹磯烬几橘講獧胶豇淨駃拣记蔣髻铰颊鼱稭旌蒋僭競侷儘絸劫疌噘锦淺浆翦缙贱鸠倔哜價罽疖箋婧绢继涧缉鐝斠具砠禁劇婕君堲焗颈蹷痉焌踘悸歼皆裌拘繭缣家惊囝蜐距弆橛襀孓瘠進缴罝佳苣糨虹箕噱噭漿驚讦极伋舺礁濟祭饥覬玠簡藎捃鲪舊勦牋瘕鸡帣墼抉颉腱殣砄霁頰輂紟跲剪柩伽跼解嫉觧稼睛璥悈蕨近巨弪桕兼鲒嚼檻矜葭机珒监奖踖麖戋齊洁睫漖隦鍵謹驕斝槳结京戟靖阶擠斤劤桀谏褯經捄撧蛟谫璣菅鞫瞼兢鳉蟣剞揪桷嚌渐檞饺瑾耤贾掘堅咀錦堇驹鲸屨觐嶠齌绝泂居姫济跡腈踞挢猄狷骏痂疥儁鞠究肌秸劗绛麇沮姜鞯鱾決餞郊岠简妗剿垍嘏寖蛺鲫皭濜饯截鬏檟秔茧毽骥嬌剧涓滘袺鹣麂靜久搢菹濺踐珏碱卺忣峤狡坰齑厥嫁僦巾燼菁减蒟齐己救尽瀱洚赍缄健爵漸角僥界筠静鵑韮憬窶鹻脊澽轇精荆燋虮鷄脛倦舉鴃拮猳咭暨桨洎賮亟薦矍轎強娟纪窭盡掬儉狙践冏镓捲絕决琎際佼飢蟭讲勥機飓鉏迦戢见儆钧既糡晙濬獍金捷娵嘉腒荐赆犟呌街覊椐介餃軍崌撿記寯晉嵇楬湨勁薑局肩轿绩廄莢桊聚锏駒刦倞匠赳鋸篯嵴煎藠樛徼剄膲駕警鑒羯屦炬槚潔譏匊癤惧袈接溍酱茳检脚鳽鲣芰筊笕鹃革戞浹笳菌劲唫鬋旧峻舌岌鬮螿監际技净鐫穽絹椒鉴厪键泃馑龃譾觊跤檢浸唧僬弶躋齎瑨且芨鴂廐脧郟稽加級竫奇楗絜槿杰蹻隽胛校氿羁鳒襟獗拒藉迳酒巠栉佶苴櫼鐍屩雎炅礆降葰蓟湫伎泾桔靳傑粳殭繋汫迹觉浕嶕涇犍珓咎谲姬鮈塈侥噤疆秬骄頸刼跔極倢牮嗟奸窘茎韁笄榉菊簴竣军柜缰坷即溅梜雋蒹鹫膠矫敬蹇妓筋揭畿矩浅孑泇扃锯仅睊岬坚据酵阱给璟瞿繼痙举荚車徛珺鞿捡穄枸揀繳挶竞蹟韭硷诘衿輯劑彊冀屆箭锔犄俭娇忌圈浚蕺乩暕戔姦齏基觭钾蹴屐踺緊级煚甲給祲喼季岨湔尖俊撅堿浃廑荠诫觖見罥叫迥筥橜鰶绞澆皦恝跽喈假楷蕉榘霽阄鐻粔節灸筴袷璡集笈靓荩裾剂夾瀽鹼琚諓茄肼皲锩勣鋏棘及鏡螀稉姞鲛计醮艱揃芥奬誡跏急鲚恔禨幾蠲痎嘦駉叽九將結景枷漈蹐进碣覺靬榤龟鱭矶謇笺郏贐焦晋焆讥韉皎褧吉墐嘰镌畯鄄勼蛱階枧玖徑捐鞬柬浇辑間玦钜攟句经艦姐鹪倨诀疚舅讵其睠醵矯賤錤傢叚據件玃津搛僵节蒺鯨紧架蹶惎夹莒逕觔積搅醬噍玑薺檵眷穊剑稷撟梮艰獎激擊间刭挟井趼殲厩櫸鹡毑茭饑臼踽礓朞颎境籍均较镢鱂鑑麕借腳掎劂峧覵刧蚧艽郡劍紀寄交遽挤較崛汲績强敫斚閒戒糾殛瑊傕建晶椾卷偈胫骱江攪龜纠湝爝系"
  "愾喟礦穅曠龕课岢慨槛宽骒煃康睽空剴柯开哐龈顆嵌适眶硜侃坑咯控诳愙诓会胯婫嚳锟鄶悃喀鄺匮擴魁圹哭卡浍纩莰榼嗑抗嘅課脍稞卝夼爌衎睏缂匼塏裉鞚栲悾鵟忼牁考檻戣骷崑塊快揢愦倥瞌窥刳匡崆裩垲剀箜絖窟欬簆筈剋壸盔況敂蝰洘括硿揆眍蒉闓垦廓筘壙筷髡铿鞹闶傀佧愷佝旷琨颗埪擖餽豈栞芤褃棵哙恺愒口槺狯坎瞘拷邝堀犪媿刲阔櫆寇寬廥坤钪鷇褲可攷壼袴伉凯啃膾矿鱠客圐澮虧垮埳烤肎闚髋會阚潰欿溃庫欵擓篑壳炕骙懇框髠孔凷苦锞吭獪摳崁焢綑珂咖醌挎劻蒯蚵狂忾搕釦扣鲙砢恳堃炌裈轲囥蝌抠彄溘聩鏗绔叩巋嵁咳儈暌昆蔻鶤鎧咵矙苛况阃坷慷堪阬洭侉看寛窾扛闊岿闿块蒈馈渴氪夸克喹顑蛞髖糠跬隗靠磡噲锎锴裤墈瞰铠肯楷墾尻犒恇逵疴掯科库贶龛磕筐愧姱凱侩鲲馗呵款轗刊恐胩悝捆恪喾焜酷殼楛铐跨扩誇鞟戡窠困揩硁奎夔砍尅勘郐亢炣矻咔枯纊鑛開髁鹍亏颏濶葵栝刻"
  "瀧堎熘鲮欄緉虑瓴圞珕离嘍龍蘞榴烙蛎霛殮烂髅钌梨菻躏鹠篮溜棱痨鳓斂砬荖掄療囹靂鬁漓驢亮檁浬籬埌荦淪黧醁鬑厘坽稆縷霤鳢蒞畧輛雷疠理柃咯奁嫽岭懒慮寮鹿麟缧倫卵艪剌麐虆蘿魉览莉鑼臉苓璐邻厲揦垆癧疁耒矑伦呖嘹笭陵鬲褸嶁仑橑類坜偻獵脔濾鬎疬屢綝蝲鎌遴琅临络瘌蟟錄徠稜噜撩喽廊苈嚦李瞵绫詈罱流醨锣捞滥酹粒峦咙玲路镏躐劉轤淶蘢栾潞褴朧浪藍俍蔞砻唠淚俩癗落曆駱囵蒌剺聯磷綠珑力猁鲢囉抡覽蘭琳垒卢捋殓祾纶翷鲡舲齡喱儡幱籣隷垏鸕砾篥珋聋禄磖泸涖墚犛臠魎啦叻骝檩篓髝濂侖僚犖铹銮臈艫镭蘆酈涼朸蠡芦簍淩癘襝褛漤劣姈艣鹂琉龙炉晾枥轢葎罹庐论锍拦嶙邋厤滷塱巒耢饠僇蜊戾鹨粮兰錸膋臚裸廬辂铑锊绿镰陆遛翎礼镂勒靈耬騾淋聾瘤黎鲤賴姥髎騄逦睩啢丽樓犂炼練嶺聊露煉稑玏蔾鸬榈鈴櫺鬣漏逯牢辣口欙邐磊趔儽鲈嘮奩醪鹭林漻蝼嚨崂瘻梁髏拢歷良蔺哢憭瀏艻濼櫟鸰镠潦胪螻勞笼裂喇莨硠嫠澇玀桹釐潾粝铼立攏录栏骊孌灵漊裣滦瞜壢澜氯恋楞碌爐磏缡壟鞡狸椋裢蠣洛锂劙鹵襤脟蓝弄飗隴癆稂梾臁藶俐阑杝菱轮掠跞陸孪留倞两腡燎连螂浏鐮胧礪臘兩泷呤脷俚橹畱糲冽莲梠厉敛鸞嵝慄料遼礱霖另灕梩綸楼濑凜寥蠊灠瓅缆廖蠟例垃老涝啰邏壘圇襕捩旅领嬾攣鏤櫳裏鸝烺儱埨賚懶鐒璃驘肋量卤傈鎏燐圙瑯镥浰攔輪栊蓢鱸磟檑踉菉裡勵欒旯罶癞蒗亷睞鏈鍊徕萝篱蹽鄰溇顱乱柳躒怜羚聆倆儸凓崚罍狼滤儷鑢梿啉脸盧哩獠愣挛簕酃籃擂瑬雒虏糧崀崃雳昽缭辽链萊籁粱懔砺鱲酪龄罗撸昤蕾瘺瀘領纜茏率啷羅簝楝嫪练崍搂樑礌澪螺臝瘘羸藜麓垄悢蘺脶轳埒辆僂鸾列罏颅萰耮攬藟鋁馏镴咾嫘蓠隶饹泠囒栌沴矓帘涟瘰隸镧連圝蓏佬倮郦勠疗籨戀瀝壠硐睖琏欏覙历犁沦赂鲁論棂伶穭铃灤舻泐锒励喨塄履来镣棃猡猎離郎辘悧棶盭婪谰亂爛乐濫洌骆廩隆礫零壚栗赖靓蜽欖榔崙吏绺利仂吝律臨了掳撈欞礧诔覼娄鯉戮摞硫揽嶗麗籮瑠冷纍令哰谅尥虜凌吕渌联赁瓈栎筤拎蛉眬擄曨籙侣唡廉悝腊辌旒躶珞篢廪陇櫪籠逻璘鹩类摟斓痢栳颣烈缕瑓刘樂嫏纑娈莱膦凛泪蓼壈六轹鱺氇凉荔絡箖櫨婁榄漉來簾岚醽辚俪屡笠睐俫粼蕗匳隣骡涞漋醴劳潋薐瞭甪铝泺蠃朗膂耧撂里褵漯唳澛箩鑾倈禮赉諒咧阆蜡鎯驪溧蔂驴嘞椤澧陋藘娌孿憐簏窿莅懍鳞累硌纚峛鑪蜋裲琭箓剅匲沥瓏闾拉癃略蔹"
  "谋扪淼麋瀰霡獏邙甿瑂模冕牟渺溟峚賣泖鹲冥獼濔們糜秒铓郿咪黽霉眽碼禖貓眸痲眄鿏牧苜勐懋沔蔴麪码靡尨貿祢蟒劘醚杪摩莽嫫么苗满澠每沫瘼茉篾冇黴米寐末没密祕鳘氂弥懣覔莫殁免卯蠎蜢蘑蠓衇妺名仫闽岷螟麿坶美腼猸脉劢滅蒙麥犛酶母蓦鸣瞑谬酕祃厖嘛鳗娒卖榠霢谩沒沬牦门槑矇眠麵夢莓俛滿丏脢麼眳獴鞔鉾猛廟嘧門忞暮麰幎幪饅黾民浼釄暝目茗穆镆姥帽泌锚罵蔓鎂茂闵木藐熳瞞昧蝐悯謬耱无茅蜜縻茫穈矛沐僶髳命万默寞萌妹酩袤艨慜漠朦馬灭摸玅焖髦愐抹濛苺貘勱缪毪瑉娩氓瞒蚂钔墨脈幔買芒镘墁魅宓蟊锰咩马旄蝥谟牡檬皿袂媒硭呇玫妙糢礳镁貌摹楣募谧喵汨悶亩蟇眯綿蠛偭鹋幂眊苠禰缅荬楙蘼瞄洣媄脄迈犸邁緜铆暋嘸泯颟漫螨昴孖绵衊鄚慢碈鉧霾惽勔渼幕媚蟎秣邈闷秘嚜猕磨冒煤觅棉蟆麽饝墓勉洺玛醿甍牻嬷膜楳庙亹蛮蠻铭乜缗谜馒盟冪嗎鹛媽埋钼敏芼猫陌瞢弭愍皌畝呒曚懑蕒纆媢抿面贸藦湄骂懵睦湎忙某麻嘿敃鬘槾漭呣镅鳴耄螞醾唛们梅謀妈孟曼瑁渑描拇懜姆蝱皃迷靣缦杩蓂牤顢脒茆貊哞馍嵋哶瞀峁慕艋笢鍪芈嫚蛑眉敉痗吗湣礞魔侔旻眇珉虻买缈霂枚毷盲瞇緍明麦梦無蔑毛沵杧彌璊靺"
  "您孽睨拗吶忸齉儂孃傩馕嗫溺浓嬭埝瑙硇蜺乸儗恧躡脓颞纽搦疟鬧蘖鲇辳挠狞難巎虐糵寧捻侬曩砮傉褭臬脑逆臲隉鎒朒柰年哝廿碾儺膿稬尼辇楠蟯輗兒暧穤濃嶩内糱惄倪嗯麑唸猱顳禰拿黏囔诺牛呢聹讷泞秊涅奴蹑腻铌穠婗苶猊農蹍辗嵲呶泥氖拟醲噥锘嫋譊耨暖怒唔囁闹糯昵煗甯旎撵狃囊鼐馁胬鸟黁佴槷獰脲菍尿钮弩倷纳鲶拧霓娜捏能凝紐赧乃納捺恁腩哪娘佞憹嫩柟囝擰祢鑷薴籋囡孼妞攆挐伲镊抝齧杻艿挪涊那啮婻嬲迺奶钕煖垴喏郳鯰耐衄钠难嚀孥镍臑笯聶惱檸女瘧孬蔫拏懦苧萘努內腦酿撚茑鲵秾喃肭镎撓奈柠你蝻鬡堖乜褦粘匿淖农衲铙夒弄薿鳥鐃宁拈恼扭南聍釀廼籹灢擬萳男嚙蛲堄坭耏咛聂暱峱攮怩呐妮陧驽濘念袅"
  "殴哦藕謳怄毆鸥讴慪区喔區嘔甌沤呕嚄偶鷗吽耦噢歐漚欧蕅瓯"
  "嗙譬俜斾噴篷蟠膀蜱蹒邳陪醅平蓬氕票纰埔拼淠杷颇滂鈚呸畔胚珀疲匹炮羆旆脬剽刨配嬪芃跑粕舖搒肧啤毘穙葩般薸鋪怕铍陂否痞坡麅憑品破楩裴踫澼洴乓慓缾丕霹潽甁棚菩瓶脯霶龐啪闝荓噼硼批厖砲猵缏闢怦磻鲏嫖趴咆鬅掱偏鄱胖劈篇镤釽缥膍罴氆抔朴烹扳坪裨泮湓牌鏺膨盆撲狍派螵琶蹁庀匏嚬殍衃屁槃鳑幈谝蒲溥苉砰片雱磐襻谱辔耙凭帔棑爿磅扑涄脾狉圃鼙裒湃疱盼哌锫濮飄蹼皰帕瞥澎縏頻椑镨礮埤蹣帡螃迫蚍吡判耪贫玭匍堋坯喷钋僕培骈凴苹霈肨排嫳胮噗跰鞶曝辟番暴扁鲆朋徬泊瀑榜廹彷苤飃莩悂叵砒瓢泙披葡撇嘭便髈皮蔈伾娉泡罷錍扒钯姘疋盤堡叛袍筢蟛抛旁淜翩彭癖剖鋬拍屏漂匉赔僻璞掊帊庞媲郫瞟骗拚仆浦奅婆蒎嚭枰逄睥蠙蓱乒評潘普蘋犏玶墣騙桲潑醱颦芘莆攀簰评椪嫔珮榀圮擗噽袢騗潖嘌骠沛笸泼飘捧毗拋甓毰狓僄貧弸皤坏牝酺俳蒱抨蚲魄掽冯陴泺庖仳琵頗胼爬铺賠佩钷萍鹏舥酦盘频碰聘枇貔繁徘"
  "妻梣羥虬寢将琴褰权朐期琼碁琹阕僉去蹡荃惓箝瓩取趄嗛汧锲槭瓊郄签親癯鹙洓禽嵌慼掐騎灈趣嵚磽锹清请绮錢戧蛐祛龋囚惸淺鳍捦弃鲯鏘芹跂翹谦蘧缉赇悛卡礄膁祁泉髂扦倾沁焌佺疧宭鮨七簽屈箧躯芩芡筇苣氍朅旗驅欽泣潜逡撽榿鉗敲佢欋黔秦讫拤蔃慤阙拳虔伽惬蛆龝砌糗癿肷萩诠矜阒炔瑲溱球骎璩牽齊荍蹊鳈槍前楸辁镪迄恰磬轻蜞慬犰庆檎踥乾搉萋拑蛣蘄魌汔諐劁呛堑岖籧嶠胊钳抢阡麒覻揿鉛俏跄攲岐麇裘愆芎岂劝诮榷趨剠臍栖弮蕖遒丘寝棋蕎熗潛鼩擒碻愜戌逑颧豈亲骑峤墙沏锓埼軀诎齐躈虯柒吢勸圻泅磲帩邛屺蕁愨仟竘群嶇亟侨峭搴企強卻僑麯鼽葜竊铨气確棨牵迁墻庼磏杞鬈唚綮撬挈玱窍祈藭綪钤瘸煢荨筌欺噙橇醛戚塙戕啓券勍窮鵲壳籤歧悽悄慊钱椠鞽呇铅顷蹌乞俟脐鰌怯侵憩碛芪區愭薔碃蜷骞颀喬噐幧鞒羣臞鏚鬐葺淒觑缱趋偢杄汽硗芑衢棬陗佉嬙且麴麹嗪稽奇蠼氢蹻嫱晴啟篋区訄确穹却缺漆鲭鹊懃湫罄凊畦谴螓翘郪鹐犍碶帬囷琪蕲茕曲凄棄坵仇炁巰鎗譴檾鸜蚯浅欹羌倩樵銎伣芍袪瞿蜣戗求瑔枪妾玘請襁胠搶橋艢黥嗆彊切佥銶蒨竅圈渠洽裙悫黢檠鞧璆蜻巯憇锖岨窃痊栔廑荠覰鸲慶勤掮踡鞦衾起檣蕉青圲蝤跷钦乔袷圊鳅茄缲腔蠐千謙萁荞坥卿娶歉邱穐婍樯启桤祺跫耆炝器箐愀將粬婘靬棊鍫龟畎氫藑殻頃琦韆藒擎墝殼敺祇蔷酋搇秌輕其蹺碕遷锵苘灊桼骐旂嘁穷埆繦绻縴薺犬覃氰棲謦契劬巧桥驱情吣秋羟锜權麕遣蛩碏綦牆茜墘亓悭顦斨强蟿谯崎全岍钎傾孅欠淇毬鍬蛴磜慳瞧氣芊俅硚纤龜憔雀鞘"
  "榕肉镕鞣饶餁娆蝾鄏容鎔蝡燃轫壤仍然熔髥茹荛蕊蕤闰嬈入髯瀼染嵘嶸芮冉蚺熱繠宂篛兒若洳冗扔偌儴蒻壖辱銳牣苒榮禳讱乳铷媆糅葚襦軟惹桡濡薷壬蕘冄婼攘润蠑仁衽箬擾热蹂勷肜爇蚋袵蠕耎認锐蕋茸蜹絨稔蘘蓉软任妊靭刃恁鄀嚷韧蓐潤蕠弱褥纴阮狨融儒饒羢饪睿喏氄焫扰瞤让人擩日瓀朊輭葇儿叒煣汝挼纫瑞认驲溽瑢瓤嬬繞荣緌绒叡孺讓绕蘂戎橈絍缛穰枘汭刄礽荏韌仞蚦溶姙堧忍如橤嚅柔颥揉"
  "艘靸笥饲锼仨苏肅楒鏁璅叜祟狲佀擻簑飔睃螄廋俟厶頌嗾膆缌涩虒糝眭凇簌廝溲食巳颂算叟僧粟梭覗嵩傃宿琐卅璲啬碎笋祀穗訴濉繐榫訟脎愬嵗蒐洓薩姒肃囌诉賽缲遡散蒜瑟隋嗉氉霰祘喪锶铯孫涘塞汜觫揌荪怂俗溯耸歳馓咝岁廁穡鹔毸娀鷥死酸司色慫四葰丝噝嗣隧掃窣薮稣桫飕孙泝糁嗦璱雖損涑罳襚嫂腮尿搜骕荽聳馊摋蓀梢耜思溞伞甦縮塑厕嗖泗挲肆髞撕筭送噻擞锁颡蹜鳃絲毿洒私臊讼瑣穟旞所飼鬆邃猻挱损悚飧萨绥弎叁驌羧竦毵嘶嗍斯狻莎菘嗽娑磉澁三穑飒埽随虽澌餗凘僳已唆嗓缩蓑螋蘇溹驷谡灑遂鸶缫似搡瘙鎖隨搔瞍素酥松簨寺谇鄋顋澀淞森愫蜙嗇唢夙骚誦撒浽燧歲濇宋痠忪索伺偲速桑丧飤赛竢厮兕扫鷫睢蛳禩藪潵诵蔌傘繖筍隼髓飱崧"
  "貪穜調橐畋盷退螣條燾梃珽藤啕炱厛塘攤梯砣擿鞉餳态忒酴添甜町蘀锬套殄体跳梌蟘膧題廷莛龆剃湉怙恬縢题曇捅迯團鄌態趿僮淘踏厗褪體煓佟滩恸沺囤儓眺涛抟闼屠搯螳柝圖脦箨岹阗挞贪鸵颋岧逖咷驼峂橢铴闥隤佗蓨谈烶堍跆突嘆蹏迢禿墖倘茼帑嗁酮沱腼躺侗啴厅鼍烫拕抬绹淟檀謄鮷脡团屉靸饦太特籐銅獭韬嚃碳庭仝溚湍漙绨銕廳锑蜓匋坨絛榃屜绦臀枱跎鳀斢澾她躰陶陁堶塔烴鲀滕忑炭苔鼗討烔推唾叨溻朓鞓忳涕同圢黇土萜鬌桐騠掭晪鞳鐋粜脫恫螗镡滔疃汀榻壇踢鰷菟肽停鐵提唐坍豘彖桯霆敨垌脱澹堤婾燂侂猯縧弢膛棠筩椭掏魋籜遢陀撻萚摊汰渟吐鶗贴洟桶笤钿跅鳎邰惝田嗵圫曈剔聽儻它嘽烃牠氽乇遝兔阘熥条透醄哃潭啼焞佃骀堆赯筒填趟听祧堂萄沓天钽嘡图倜託蹋鲐腿稌鞀毯菼缇蜕鼉痰挺艇侻饕摶聼婷羰璮談鹈慟途吞裼铜窕糖臺趯壜逃鼟怹搪酡洞秃镗妥饧拖逷探俶蓚鼧魠檯忐投騰凃餹鲖驮瑱呫髫墰畠溏歎呔弟鷉癱煺饨屯托谭統菾蹄擡餮穨铽荑庹貼钍蹚尵駝奤头鯈磹樘鲦瞳耥涂腆侹替颱砼慝钛彈馱罈觍仛糶薙罎拓淌嬥腾嚏坛台韜瑭坦峒铁圕疼镋葖调傥慆暾汤畑钭駞豚嗒弹忝縚徒檮兎頭褟塌餂亭骰衕叹灘糰舔搨彤篖钂颓塗遆洮铤瑅童焘通坉挑倓潼昙薹槖瘏酞濤燙橦讨铊鿎覃挩魄痌瘫柁荼誊泰悌漯郯他袒桃胎凸惔腯醣葶嵞醰惕醍苕兲湯梼佻统偷痛蜩脁埫帖"
  "姝瀧试嶦鎩螫筛繩釋瘦虱菽勺睒柵慑蜀蒴腎虵雙腨燊師刷匙侍埘杉揲捎湿豕毹歙适腧饍说峙识礵苫山嘘烧鄃葚商淑屍拭娠殳竖笙獅折呻视芟伤栓逝贳牲奭倐赎鐥恕薯熵疎贖塽數摋梢禅数疝夀歃挲涉吮婶審嗜昰鉥甩試聖蝕属跚骦溮屬澠湜闪税唰召膻糬士鲨澨深驶竪蜃孰紳鰤剎帥擅艄甚痁阇壽佘市傻双烁蒔誓戍蝨殺昚身输單尗兽乘摔省傷使刪襫瘆师栻舐掺奢鹴参葹樞刹儵懾时衫垧暑舢矢賞騻神麝韶澍摅铩椹狩首示適儍鸤甥孀寿蛸說鿃順珊姗勢捨鱓啥蟮蓍色媞搠癙駪鲹糁舒矟稍绍烻裟赡裳裋觞庶潲射飾炻書陎讅胜瀋尚审玿陝水埏挱痧邵珅渖剩铈豎蟀慴篩失艏顺讪绅俞声盛哨殖漱事厦社饰室滲疏祏狮石谥诗晒辻朔殊嬸柹鑠恃鰣設廈卋泷沭鼫眘书收槊势獸糝卲氏食舌燒绳沈誰酾鲥圣式豉十始秫什柖世纾砷藷厍溼鰺駛睡樹嵊輋邿滠赸峕蓡屎释鼠墠觴骟闩蔬剡慎紗隃涮舍扇爽鲺晟掞署实勝叔伸陕稅妁筮紹拾羶殇树善柿砂率墡衰姍霎抒芍汕識铄绶浉晌熟倏墅谂栅硕屾箑塒嗄谁湦授赦詩升釃視漴钐昇施手曙莘攝黍沙爍収攄帨仕閃畬唼赏嬗哂畲单少弑鳝瞫尸撣鞝墒诜掸瞬潸霜摄耆帅眚鷞鄯棽渗汤束煞守諡渑籸灄肾塾杓甡梳耍賸赊輸絁史猞申寔殤煽曬禪侁生婌陞膳莎噬搧枢矧劭设杀筲受是删摻似帹參上纱述胂濕蚀绱舜蛇楯莳時轼睄術苕實朮湯澘拴葠聲瘮椉缮术售鞘晱"
  "黰榛酎嶦杼穜査螫椥浞皻锺倬诛窄甃柵竚找榨紙砦章僎脹揸蛰鄭紾滯鄣住冢咒咤擿瘈琢醡拃传贮譔值痣椎酖痄峙氊识兆宙终盏胀帋缜砧錣蒸漳燭忮櫫照獉禛茱終折睁磔跂止着彰瘴蟑绉僮遮赭帳纣瞻致桩卓籀繇齋祗證豸枝诈搩炷疰浈椆膣诊择咮崭缴债属渚鑄屬戆哳註锗正赈摺緻寨筯召准晊碡镇祭礃沚襵飦涨莊卮专筑枕樟伷霅髽诼諸壯钟哲墜喌鍼茽陳指漲砟芷週溱闸誌志趙丁齊盅詝嘱長州粧制赵粥妯窒鲊瘃沼甄檛呪衹盩狀黹鑕迍张叕浊支鍾忠鹧灼胄簻胝诸矚蝃絷肇朱坠桎赚佔轵中脂禚摣椹轸塜跖震捉躅宅摘塼讁箒張乍笊晫餦準篆辗状这甽骘针厔侧缀炙账鳣蛛贽招贄筝铢撾嶄棁潴锧踵閘陣狾战執帜挚辙樝挓紵咫炸躑荮輙淛置舯爪葴轾搾紮踯甴喳汋袠譸眾肈膇仉篹只鸷鸼製圳觯砫腫幛查峥嘲侏廌周执洙肫偵驟籑摭诏鱵彸柘撰妆栴植馇傳鎮賙振殖站溠鷙跱豬绽擇讋礩質蚛曌蘵柊挝旃雉柱镯隻癥智谵伫駐浙渣帚囀這埻侜鬇纼氏苎棹診注毡洲掙嗻枳稙烝璋妝櫂壮证陟颤追謅窀众滍睜珠蘸皱啫竹长札擢织整郑褚躓眨賺穉挣铡珍辄裝诪梔蟄蹠貯樁麈寘逐針栉蔗晢仗朕阵鲭仲展祉啁邾斫斸槠磚斲詟邅婤侦鷟沾織牐梽斟稚疹昼泜祝职帐扺隹猘姪晣真蜇辀楂拯帙蛀皺惴氈肿硃蓁争鱆証址政栈滞胗煠喆識竺冑啄赒怔醊装痔斋偡苲至踬馔柷重谪瑱呫螽株紥詹之栅飐衆耑吒畛茋征椓築屯佇黵桌奘觶纻舟贞碪鬒琖縶啭酯斮昭斩瑧旐湛瑑漴稹柞栀種嶂者芝鹯知涿烛拽疐翥肘颛鮡埴掌旨酌職櫛搌障珎爭蛭瘵焯麞纸彘肢綴铚幟朝濯缒锥鋜專伀徵舳衷驻诤掷賬鲝瞩著箸种骓茁膞揕蹢幢占症桢杖箴掫铸衠骤转吱祯郅縐祇砖轴霑袗钊鸩嫜蚱炤钲趾铮盞饘獐赘擲芧治奓劚榰沌拄秩狰咋猪谆诌債棧巵直助甎翟橥帧鐘齇庄庤抓戰囑阯瀦蠋紩濁粘晝摯恉蜡轉昣忪质劄主暲爆僽喋拙撞禔丈煮侄臻褶軸畤蜘罩术汁跩扎轧"
  "喂琬罻蜿铻螱葳蛙斡瞈纬痿娃忨蕹谓闈誣煨韙忘隖渦嵬椀萎襪廆鼃烏惋猥汶违巍湋幄萬闻苇甕頠唔伍蝸梧洼袜葦洧娓帏炜诿菀榅誤汪滃芜違坬蓊恶慰逶屋偉娲緯蕪塆芄王韋维萵兀炆啎問暐痏婺误辋椳韡珸鹟韪隈物涡洈畖蜈塕忤危偽溈渭凹伟龌豱挖喔蕰翫衛旺完尾嫵蝟遗圬杌迕肟歪蝛鮠晤辒鎢玟位亾躗五穩污刓吻尢闱窪硊卧蔓碗嗡玩撾腕桅煒无瓮鼯瘟佤呜倭涴廡瓦璺纹万為頑瑋汙涠扤屼骛喎勿烷鹜峗亡韤娩盌韦鳁莞灣芒踒阢渥蜗巫挽挝钨牾悞餧伪我网莴務微雾妄哇戊舞翁脗皖螉窝惘壪網幃鲔骫诬偎憮煟剜罔爲毋鄔輓汚畏僞坞蔿雯务捂畹齆沃卫鳂寤婉沩崴抏謂纨焐脘晚握温蒍潙芴豌委抆邬外鳚彎鹀亹窊为魏未浯薳惡汍鋈蚊暡宛痦霧溦揻於妩邷蝄午威呒鹉隗揾塭靰紋碨妧紊尪婠潿罋旿潍嗚硪唯吳腽硙味乌霨磑碔薇庑琟俉丸胃窩衞圩維圍尉餵刎偓杇帵魍武郚塢讏湾问珷顽猬蔚帷侮潕惟吾文蟁吴摀芠仵臥玮怃峿洿聞往卼溫弯澫媧娬稳穵無悟艉阌枉围绾望"
  "馅淆倖蟢协咸褻讯陿岫響潟踅翈歗糈杴淅梟咻销冔熏楔郋虾姁县禤谖琄鋅榍勰豨卹绚絃邢霰歙餳譆鲜烜霄效锬猇鹇蠵絏缃歘凶葸溆嘘矽孝忻忷瀟璽虚褏勗吸馐驯燹瓖详唏席選鬚性盻膝荥豀喧廵幰响醯靴序噀阋硍塮餡滎休恓蓿西鸮蛵诇祥瑆学烯霫邪噱壻鞵爔寻蟋哮貅潯薟戯辖锨暄缐祫湑颉炫晅苋跹蠏解獫揎繡嶲小狝向铏旋狥隙媭璇鼷纖暿皙徇讻鲟询骁翔泄傚珣绣许嗅晛缿蹊飨晰瘜些窨襭澥敘媳咲毨箱蓆擤魆巽暶省褎秀鮮譞昕炘脇胷續盨錫饩象薢希循崤恂胁險鱮贤茓选儇峋擕喜獯形消鷳獬曉悉钘雪莕心敍媟攜舝嶍鉨柙羨潠芎脩葙狹栖嶨狭舷铉饻厢蛸尟杏朽洨泻砉蚬薰勖琇像嫌戌習辛汐橡续谿粞训翕熺枭隰雄庥觿痃萧蕈珛相瀉筅醒湘险訢焮晳享镶侠懁灺谐玄匣羲銷现饷羞戲饗荤嫺乡莶賉析熙镡煖許蝑徯蘐憙髤息徐迅謏溴行項釐鲞協垿鑲欷萱癣蟹瑄咺弦屧汹魈见濬罅奚硝羡榭先腥廨洫厦眩浔血衖藓陘簫恤鏇徙睎胥纁斜匈驍习亵惺嚻賢陷晞盱啣荨栩伈憲昡詳唬笑汛券禧薛歔悬躞嬛箲细恟骍廈詢玺叶线绤撷璕芯尋尠衔骧脅筊宪噓轩嬉硤酅屑郗陉郇蝦渫秈诩兇煊銜牺哅铣溪楦邂戏下啸襲峽想嶮蕭袖傒訊显婞齘筱需俠暹絜蝎挦鳕犧校偕硖係蓰昫臭缬鳛鏽郤絢栒現降墟新穴薌撏磎嘯削顯俙渲繫舾兄銗煋熊吁鯗逊旬觽嘻揳嶰兴裼熹虩紃禒惜袭蟏狎跣偰婿檄崄菥巇顖鲑緒型碹縣髹饧嚣廂須襄歆癇蓄玹炧窸掀谢咥勳禊逍挾鉉嚇殽携斅興欻禼姓鄉须祆歇蜥修峡燻僖浚浠餼鰕囟燮虓虛珝遜陜隟曛篠洶屃熄械献學螅氙蠨躚莘見屟鱏鑫僊鎋瑕効洗衅霞鱘宿荇泫瀣魖舋锌獮肸馨煦蠍寫籼谑肖訏吓悻閑潇稀翾埙觋刑鸺斈鬩哓懈写信巷涍硒愃岘玁欣線叙薪屣胸洩緤樨项謝穸細鱚卨绪顼痫噚獻鹹圩絮腊暇鞋硎旭瞎壎伭黠箵洵畜峃旴夐遐敩叚嘵冼兮熻洒锈舄芗衒星香巡訓屭璿綫芧呷枵鄩铦滫勋滧懸珦詾挟契鞾箫皛噏晓爕酗绁腺幸荀酰仙漩嚮卸宵夕涎夏娴殉楥曦猃猩娭浒鶱宣昔釁庠茜犀薤闲忺枲閒孅纚谞锡绡醑醺限滀纤卌翛曏系"
  "雅盐铻觃呎佣馧钥铕窑喑薁螢椅喭弈堐縯黡冘藝禕鸳輿蝓贻滢耘嫄氲吆飲夭螘宥戉瑒尹腌茵扬甬亚寅颍矣铘伃讞熠虞慵璵语鴉御舣弋营蝣椸厌苅烨龈傭爗菸籰雝嗌婣墕译说优耶禋以瑀醫迆瑜枻岩钺俣哑萮繄呓鹢運娛袎茚義蘊愉演麀蜒圯胰芋樾鶃籲嵒言曳垣媖谒揠勻應唷荥霙噫桠槱潏瘖夤儼赢怏聿妘缘贗硍嘤繇隐貐悒预莺鸯滎鞅園菀邑驛淊旸引鮨踦阎洇湲韫琰圜敭鷃堉么谕谣苢伢邪嚥咬釅沅鼴郓鷹艺慾迂靷恹芽籥翊昱吟鹞螈倚野约医鴳屹玡幺痍眙鄞俨雩埡牖喲悠玥翌鼬箷筵廙鲬钖鲉嶧园湮蓺意裕籝絪油阏瘗閱鴈壹缨壓阳隅颙倻鹆弌郢月嶷骃佚漪訑釉憖云药腴阈瑶遊窨崖婴愈揶易犹壅圆粥嶢囿癮渊揚萸埸晔咽鬱娱妍怿毓友異铱猷龑厴涢咉饐赟魊越圄验蟻閆闉肄埜远羽英儀喁曜罃囈殀宇勚慇墉有嬴鹦窳遇又楊幽跃兖尾郧遗訝恿瀠礜猿癰蛜姚烊螠圓灧酽昀淯蚴鳙憂焰懨样遥挜栧議燄瘀氧狖癢籯撄邮仰檐鸭莹赝垟妪蟫飏幼枒庽鹽尢陶蕓檃亱噦喻盈裛迻涌渔潆潩蜎啢咿億鄢雍軋韻狳鹬歟瘾罨峪煬簷陽唁誉巘刖蚖羊钰喓猺秧龉烻踴甗觺浥矞悅僥鄴筠佑渰龠圻讶漹昳漾願砑傜踊仡嚚醖哟黝遙硏驭偊涴眼薏阅殪呦与櫟癔鈾氬瞖酝宜咏玙姻膺庾鎣餍院黿腰役燁驿玗詑垸焉苡譯艤迓禺谷姸彟泆予厣艳隱寱议偃鵶沄彦臙疣藥醃窬溵荫掖焱衣嫗瀅原鷰俞鴨逸嬿蔭应澐顗斿崟罭液嶪椰媱蜮谚炀谀羿踰蝘佯阴疫溁宴痈要堙莸蝇崯養玚婭韵夷爻樣傴崕饴鹰娅楪黟蛾鶂宧俑荧峣臃叶羑爺肴猗袁鱿铅诒堰用鳽塋魇疡辕擁爓顏吖疟唫食貤摇谳印游泱晕訚匀余砚圫虤郁乙褕岳嶽佁舆乂茔延姨煴怡衍懮挹啞馀逾圉枍澭也狱亞媵塬罂猶抑蓥锳箢卣魣悆一轶祐陰杳埇熨垚彜央瘍涯瘐蚓厭氩翼齮燚渝源窅熒咦掩杙獄魚語奄饮恙镛异谊慂纡棫勇珢壄餘剡扊缊雁酉溢铫痖诣臆沇沿嬰映愠猰胭萦鄘瑗纭亦吁邘歈豔侥鄾掞舀彝廕夜揜哩禹睚瀹呀晻疋業淹爷寓嶼邺窈狺鸑钇婬媛悦湧黦丫诱硬阉邀霪暆瘿曰银預漁與镱欹揘垠哕影怨橼艷懕鹝琊醼曱筼爚益艾靨龂鼋仪萤欤鋆刈銀毅曄峄冤豫瑛饜宛瑩玉暎窰欲蠅鍚穎弇於眢螾譽隂嗈鴥耀业籆禦绎芫酏荑扅驗堨淤爰窯頁髃暈椏郵靿魘徭垭甖义尧寃嘢懌拽殃煜燠誼畬嫛屿葉珧蘡牙優畲妧泳樱慭緣匜缢页掾毉乐依员蝤鱼押祎憶衏右颺黶櫽裀員佾域洢噰铟約蚁吋鑰濙齩耰蚰劓愚柚搖闫詠殗輶殷援軏压蛹严邕由戭吚颜忆噎璎舁裔觎曀繹鹥靥栎鳐誘瘉掗因彧郾馌讛蚜庸燕彠粤揖唡嵎譍鶯鸎养烟營沂巖榆蜴讔尉元懿肊扆暘厓蕴鸦侑伊苑音躍愔滪铀鬻樂敔讌抴猨瀛岈嵛臾恽颖煙妤跀莜蠮奕垽謠餚韞研冶浟尤忧畇蔚轺鹓歅痒竽滧雲迎愿亿孕瘧氤已晏胤燿燏镒栐拥遹盂縈旖蕕移簃妖淫棪雨淵齵瘂騐衙遠陨饫徉嫣疑崦殒羕揄滟肬蛇嚴鼹允芸檥楹于育揅峿瘞癒阽隩蛘暍羱运炎莠腋攸伛艅鸢浴狁杨蓣嫕鄅崾抈吲颐堯唈飖旟迤洋饔遺永翳矱轧"
  "諮瓒譟慥宰嶟舴昝赜髒族最崽柞烖蹔咂崪騣坐竈燥贼秭暫葄璪檇葅宗踪眦租罾缵剚咀珇桚阼诹组子襍祖趱攒载诅奏淄资儹昨赚倳齱縂琢暂偺嘴鲻孜組責籽緅帀茈鄫驵尊啧脧栽缯走杂躜堆总泽總鄹錾怎祚簪鬃匝茲赠矰訾菹簉邹槜讚曾晬蚤僔谘唑嵫侧皁在崒糟阻梓篸攥纂啙棕載災辠佐則虸呰趦糉枞郰作孖臜俎造撙縱紫傤騌滋姊罇吱菑足灶纵澡寁兹早胙咱腙鄑渍樽笫胔孳蹤陬鲰箦綜鬷觜择耔賊迮遭瘲賛贜紮粢雜臧镞攢缁鼒赞贊澤拶噂撮騶锃左枣皂喒牂篹龇座增牸咋责昃捘酢岞滓咨臟酂鑿倧赀笮自鲗籑齚椶鄒怍罪眥灾藻憎樅字驺簀摠藏躁钻呲糌仄赃資鑽胾噆捽捴综擇醉甑髭贓谮紥粽再嗞揍齰蕞帻嘬做鳟卒筰辎唣恣噪趑遵锱仔砸葬姿脏凿则偬哉奘甾疭棗蹧傯镃扎灒"
))
(defconst pinyinlib--traditional-char-table '(
  "鵪拗垵闇薁凹嬡安礙襖噯吖媼聱愛翺曖黯敖桉騃醃硋奧岸媕嶅廠氨呆曖垇俺按嗌岙矮磑鵪枊謷呵隞鰲皚厫骯遨靉毐菴璦卬廣藹阿翱哎懊銨錒庵嬡盎揞熬抝晻暗諳藹腤哀傲愛案鎄啊犴埯鼇砹囂薆靉埃靄挨奡艾慠獒坳癌嗷驁隘礙廒璈螯唵襖娭盦噯爊隩唉昂欸骯鏊鏖璦皚鞌嗄捱嶴鞍胺澳"
  "孛被鑣八飈蛃啵坂犇萹膀羓櫱鞭駁愎茇苞擺鞞蔽補艑豝埔蹦叭頒儦鯾詖髆鰏傍柄妣鞛匾擺梆拔炮唄揹煏貶刨坌鱍版滮饆皀迸蓽昺辦悲渤亳鄙邊邲搒躃憊齙弻祊孢奰鮑閟丙蜯笆般綁襬比獘本保鑤辮哱愊膊賁雹陂阪邦塝倴並碥潷灞祕鏢邶萆背半艴牓舨甏梐擯繃蹕癿馝鞴苄鑌薄不搏苯缽捌步蚌壩餑踣湢邠濞彼脿庯鑌浡俻幫鉍摒緶粑朳咇舶餅掰蔀腷濱鰾鵓虣拜褊逼扳伯裨褒猋膘籩卑襮簿柈瀕偪僰筆艕焙甭檗篦殯賓泌杯哺幣癟斑表餺闆彆寶佰鐾畢弼蝙鈑碑玻辮熛舭鵏卟鉋白婊鈈飽捕必蚆巴峇岜鼥檳唄弁變癟畢稖臏粃剝爸誖耙盋崩湴磅豹擘變包鬢髀壁荸梖濱鉑碧稟蔔婢駁豳稟埗怖嗶摽邊閉䰾晡緥椑狽覇別狴峬蹕砵襃篳佈辯畀拌芭檳飇襏菶窆攽臂抱吡陛髩鱉昪驫菢北襏庇播鏰砭繃玤憋蓓培餔綁筆藨逋褓韛觱鋇稨繽秉帛蝂靶賔報曝闢夯並幖暴扁錶錛泊瀑惼竝榜敗屄伴鎊吥布鉢鴇璧霸便板髈蔈琲夿蒡笓疤炳罷貝扒罷鈀汴躄敗昞菝襞弊浜痹祕標堡毖瓣邴嬖胈跛冰蹩頒捭獙斌奔貝飆卜部儐瘢棒醭佊埠髕屏憊倂搬嘣薜欛颮趵畚埲擯坢靽箔馞輩辨藊繽壩編穮礴辦皕儐苾波珌睥鵯蕃報菠跋簸坒氷贔抃百瓿斃欂沘簙謗褙秕桲寶徧鼻兵魃蓽餅栢芘飽逩扮玢篳避鵖坋輩絆嗶博昄葆柏胞裱杓撥髕鮊琫吧笨糒驃彪編鎛籩備把鬢寳賓瀌箅閉卞幫髲妭嶓悖鈸栟遍標臏煲痺臕鼈癍魄匕脖棓煸剝倍稗別勃泵潷蓖補病鯿敝枹拂庳撥駮碚狽駜殯斃幣鞁盃瘭辯佖爆備桮鮁彬忭班篰梹俾俵"
  "惻財螬琮腠斮慘梣瑽悰摻滄側汆黲啐材毳跐邨從參囪噌蹲粗彩蒼鑹漼麁倉祠倸攢此慙冊筞湊簇倅筴攛蹵催嘈蔟採殘蓯飡測詞猜財層剒悤刺吋棤痤漕菜踆聰磁茈銼趣焠嶒獕麤蓯礤蔡淙摧操促慈甆縩詞踧滄艙綵湌跴賨蠶廁糙曾驄刌瓷淬藂縗存瘁測觕側疵慚剉脆拆餈篸莝湊鏦蹉懆睬纔艸樅聰餈囪辤傖堲辭瑳層擦冊叢膵厝皴蒼蹙躥茲廁躥槽薋蔥燦辭鷀嵯璨騲爨雌萃差艙璀翠匆寸蹭徂熜錯顇醋崔撮叢涔錯傖搓策黲泚矬玼憱悴酢驂從挫攛脞酇殘綷寀村憯採鹺衰竄肏次磋佽摻篡粲樷殂茨猝賜參驂璁鑹樅鮆藏鶬呲脃瘥鹺粹餐怱曹脺草伺才孱埰偲蔥穇鶬欑蠶措卒踩倉燦裁莿慚岑輳絘艚蹴榱忖竄嚓慘"
  "墮頓擋禫萣靛斷狄跺調凼簹締到督燾跢蹬獨定蚪朵幬儋巔碟蓧銩篤掉唙島打諦黷礅禱鐸惰舠璫呆咄揲妲燉儅碫襠疊燉町傎柮嘚奪錞舵垛堵跕啖嗲迨懂棟岱淡嵽氐祋倒鼕殜氘訂澱躲懟竇襠簞汏黱犢遯鈍緞蹀點誕囤癲鰈甔屌擣椆凋脦道蹾襶毒敵端襌咑傣貸羶碡鶇撉剟痘扽導蔸櫝甸芏闍鄲嚲跌讜璒噠睹殫待釣掇丁蕩侗癜盪隄玓肚蒂電遞攧叮崬篼單釘帝鍍頂廸逮點答墮底妒大鬭滌盯繨靼凍鞮嚲墶蹲槑溚獨瞪蝃達凟韃典滴髑靪汈隊砥瑖迭躉耋啗妬玎韃店錠顛絛鼎瀆丟搭眈宕對鍀撴驐籪碘氡塅竇憚的歹琱塔碉鎝糴蠹壋抖丹紿彫跥叨鳥簦黨豆糴黷登鏑昳哆鵰噸炸軃擔啶黨盾銱恫蝀酊德睇讟頔遁矴靆觝兜仃鍛癉瀆刁虰敓電提嚪煅踶噹蜨垌堤澹石島殫剁鐺鐺鬥渡骶墊東黕甙耼疍楪擔盜檔犢逗褝禱爹曡嶝玷絰鈿埭壋獃鼦俤鬥帶嘀牒堞鄧簹枓荳躂鶇噔闒諜魛蕩佃訂駘堆帶螙鄲玳籪沓靆垈垤貂董蜑釣怠悼磴脰疸菂碓戴奠怛銚讀兌隊誕多埵嘟朶奪代敁鐸奲鐙飿噸唗椗哚旦遞蹈琔詆櫈搗鄧鐓導凙杜當噉洞第敠掂耷疔踮讀棣賭鯛働坻髧亶磾櫝氹躭澱段嶌噠地羝攩薘惦鍛對簞軑賧馱敪瘩碇殆黛覩呔耑捯弟茋墊得都咚等酘讜棟撢蝶硐賭懟弔低搗荻耵忉薘憚抵螮崬但坫躱單笪殿匵膽飣墬腖阧窵璫疊敵鬦撣彈樀鬬氮撣笛憝萏瑇椴纛垜短踱伄峒冬錠瓞調腖簟髢碭鈄嗒彈覿達丟蹢東頂腚憺褡燈滇稻凍刀滌叼裰雕牴鋌墩迪燾柢牘吊盹媂膽戥覿釘癉沌䃮餖擋澄耽刴娣惇碲禘翟炟鍍柁緞聃厾砘頓斷嫡度杕當袋贉扂阽動陡楯蝳凳鳥菪蛋躉喋荅惪締胴碭動蠧燈邸幬顛蔕敦牘盜檔墶"
  "誒貳噩譌鱷吪軛鮞鵝頞陑爾鶚奀餓鉺二餌齶工戹痾兒蚵恩爾嗯哦呃苊呝鵞摁鍔搤娿阨胹愕鱷佴邇蒽峨阿婀咡額鄂崿莪屙俄娥輀厄洏餓扼堊訛額噁洱惡耳兒邇姶皒諤涐峩鞥鋨而遏惡閼弍鵝顎堊齶欸鴯誒珥萼囮耏蛾堨刵"
  "廢乶鈁鳳鳧灋法舫縛蠭洑費垡鋒縫坊飯奮罘倣腹砆翻菔豶奮閥烽朆蝜髣賦畈頫颿服淝呋麩篚俸閥扉旛棻付氾紡鄜彿釜輔茯煩汾甫芣幅鱝複鈇否鮒份瞓匐腓弗赴憤苻艴吠肥蝠罸僨氟釩蚡婦市瘋箙氛脯輻伐賵祓蝮幞黻諷憤肺朏芬負夫方礬芳襆俛縫俘瘋忿腑緋鰒福範雰泛榑廢瀵趺反琺飯孵枋販鬴楓沸蚄腐訃甮咐逢魴幡婦坿諷豐蜉賻輻傅鐨符風砩蹯膚紡髮蜚房煩帆宓痡富芙鳯鮄刜飛府孚砝墳伏菲罰焚緐榧騑葑桴璠燔筏跗復唪馥鯡訪父韍拊滏番怫礬彷莩昉覆崶袱灃痱茀祔蜂飛復撫酚棼芾妃附風紱凢翡棐稃汎糞柎鋒鷭俯縛範仿費覅墦敷誹郛酆髴悱琈罰膚駙垺翂匪糞粉負紛阜霏韍蕃簠缶販妨栿放返訪牥浮狒嬎繙罦乏覂渢伕醱發防涪鴔斐鼢玢肪浲黼坋撫疿蘩豐鳳剕啡峯輔副峯非扶撨琺吩膰紛分犯碸凡佛玞樊鳧斧奉灃馮紼封枹拂鵩蚨犎梵墳發醱藩邡繁"
  "鴰管鉤荄姽槀溉戈媯聝雊綱虼尷剛戛貢垙價搞渦袞蟈臯館股搿鈣琯棡坩膕矼槼廆沽蒄咯稾瓘玍梏鶊劌緱個牿鯀匱剮鰥絓榖鬲擀旮糕廣骨頸規耇庪家圪稈扞甘虢鉻狗鴿戇坬輥夬膈箍颳淦刮哥蠱蛄爟屹哽勾鋼岡伽彀公獷酐哿咼幹矜尜炔綸汩鬼騧堝夠鵠虷慣鍋獷菰渦辜骾冠卦匭掆瘝宄蜾乾関睪搆缸詿彍攻鎬鶻賈轕括聒擱槓疳過咼瑰澉嗝傀孤嘏陔梗佝詭規涫該磙綱灌更謌歸櫜蓋顧丱滾郭紺汞邽鱖柑桄歌皋弓觀罆格罡檜盥個鋼岣閨界垢尲該鯁胍貴珙緪棺舘仡彉筻稈苟耕榦鞏鎘蓋鯝果觚趕榾國袞蚣珪覯泔僱堩贛艮谷宮鱤錧葛癸痼箇躬莞罐酤鉤韝暠瞽忓埂鈷亙貫漍桿尕剛牯睾馘轂胳鈣鋯紅隑共顧崗罛嘎嬀軌槨貴瀔玕怪橰趕革綸關詁陒浭肱咖佹耿皈輨堌姑臌剮嬀嗊晷根固氿紇構匄劌痯塨槁觥槨摑柺炅杲鸛龔菓躳毌苷杆告緺桂觀故國鿍逛鬹貫貢構概高槔錮頸幗宮罣拐橄縞羹摑港餻購遘鞏櫃溝棍丐竿鮭乖篝鈷苽餶割笴藁賡肛劊珖歸給鴿跪崮洸釭笱刈扛簋圭寡枸釓倌疙尬囯餎塥膏庚餜垝郜估鱥給關硔敢戤筦跟灨僱崗旰瓜軲鴣罟堽檜栱官功粿咣菇拱茛櫃筶工肐古夾購廣各亙蟈龔冓芥夠晐頜供緄龜篙硅崞幗姤贑筀擱鮌句改滾蓇呱芶𣈶綆茖袼冮蛤耈褂緪慣摜夾堝軋穀瓌骭呷庋膕裹間盬合岡誥矸䲘媾舸滆掛鼓咕蠱恠羖祼閨過光羔畊絚館詬閣幹胱骼賅隔肝尷閤劀詭軌鍋噶稿槓硌哏栝垓恭龜軱劊掛溝感"
  "乎耠鉷垾圂喙魟虎鐶好咴洪潓皝頷騞鶡顥恚蝦讙澒豢麾翽熇惶閡鐄隺吽恍狐蘅諢濊浬活呼害癀佪喚卉撝滑繪褘琥蝗鬟蠖鸌蠔闠盒灰會溷怙徨哼瀚踝穢幌翽橫譁鱟歡輝黌護翃唿斛煳澮澴幠葓鱟紅獲啈曷塃湟翮恆軤扞圜喊晃嚎搰黌鈜虹號匯旱函戱噑煥笏亥鍰霍囬鄠嘩蔊渾歡衡暵貉誨很暉隍憾嚆惚戶訶赫環鱯姮喉雙喝豗賄嚄岵樺鵠虷滬烠賀奐榥薈戶謊鶘畫畫盇皓觟墮惛燴繯槵洄諱邯祜侯薅鶻鎬晗筕滉弧瑝喚恨灝壺或峘驊橞喤換夥何桓遑譁潢猾黃轟沍釬繢訸囘迴皜堼獲隳華闔餛夥噦絎砉嫿毀轟餄堠哈䴉硊荷胲惑燬閎薨菏懷詼渙檜海憨互厚戲漢葷奐環酣瘓緩訶揮糊槐輝頏猢惠行焊昊禍漷盉蛔彠禍毀僡耲咍漢黃韓幻簧凰郃暠浛澮蝴匯冱鏵揮換滬鏵駭漶會闞嗥紅唬潰晦枑擐蟥盍嬛繪毫患護藿怳嗬篁荁穫嵅吭澣戽閽玒琀殨郇蝦捍嚾攉猴嘑虺翰昏湖逅鉿黑觳豪貛竑核戲恆貨睆賀澔銲渾嗊廻醐紇夯滙磺鰉鶴雚珩迒蕻沆轘熯嫿縠譭橫鑊徽含撼還翯吰岾餱郝褐碈咳槥垎囫覈緩齕鮜嗐訇貨慧噷回獾驊後懷醢候臛化韓谼蚶噦欱徊佫瓛火還闤蕙蔧餱慁鯇嚇魂鈥逭蒿鬨蟪洹紘豞鼾脝餬鬍淏慌骺鴻肓鍃浣淮郈靧鴴璜皞涵衚吼貆硔浩瓠豁佸圅謊奤揈憓狠河嫭桁檜悔胡壕嚯訌壑菡悍鍠瘊荒槲劾嚇搳嘿淴齁杭忽話和烀劃孩巷汗唅龢頜鄗彙泓呵篌寰蛕滈瑚萑濠涸花樺婚睅痕劃氦褘號華剨驩崡昒蚘罕蠔楛琿垕宏頇篲嗨壞蛤嘒皇壺蠚壞後話懽鞨犴薈合混扈燴耗葒撖昈篊媓骸彗劐葫恢閈煇茴哄烘焓航滸煌宦穢滹諱閤弘寒亨艎睺翬禾邗濩"
  "衩癡瀍呎沖梣蠢籌蒭螭車噌嬋幬噇琡瑒鑱鶉蠆纏杵塵暢竾匙廠侈櫥牎瘈磣儲臣稠倕承罿蠆傳菖椎庱叉窻歘讎寵錞炒鋮疇鱨茶搊撐逴謿拆嵖瞠儳斶赬檉翄嗤疢酬禪閶驏澂綝牚趁產喘醜稱椆滻籌磣醇窗斥裎耖秤硨箎酲躕串鑔綢艟船勦辵崇抄剎揣椿懺奼唱穿陳倘敕闖倀儕讎娖韔椽孱箠長亍猹嘽憕鏟抶踹楮牕酧樗諔蟾單償潮捵乘躔蹅處馳愴誠讖蟲抻摻礎叱諶鶉剙捶錘耡躊鼂哧剎觸熾純処殠誠初澶程踸闡橙舩窓墀惆詫堾遲啻嬋瞋濋旾剿呈茬羼巢閦蓴綽怵晨嫦魑廠廛萇塵湧剗櫥綴腸黜惷遄櫬啜鶵滁鶒歠茝撐晁傖珹雛齒川陲諂蚩辰輟槎裳偁銃牀懲儔蟶喳纏詧鐔持檉搽腸鯧蟶傖僝凔讒出棰儕柴嘲喫查鉏楚鎚俥堘梴韂處廚衝餷嘗盛弛傳綢娼抽鈔吹鋤裯寵鈔沉鍤悵懺踳鐺鐺瑒眵棖硶齒馳辴雛產察瘛舛詫臿齪憷暢丞儭稱逞瑃琛饞茺趂宬惝胣嚫幮常齼嘽沈塍愴躊瘡顫偢厰囅篘瘳豉長奼絀償蝽褚蟬褫敞臭脣搥嗔産襯舡忱攙瞅扯瘡膗婤徹煁襯超檫吵晟齣膪饞踔撤錘仇珫嚐充牀差訦憧杻圌郴摏忡珵憃楂熾汊淳舂癡嘗俶芻坻愁醜鋹掣鏟剗怊篨車櫬成蟲徜礎岔摴撦躇翀攙鴟欻重柷呫徹搐創旵遲弨廚躕池蜍巉宸懲純萇輴漴艖陳儔倡辿除悵蓴鬯豺單埕戳僢昌闡垞醻痓篅矗焯飭朝塲插鋤絺勑槌扠坼倀釵脣茌瓻潺棽惙媸種婼篪胵搋幢犨齔城彳衝剷恥讒畜趻歜漘芻氚炊儲蟬笞猖禪場顫漦郕黐讐澄唓觸滻覘囅喫摻昶尺碴剏翅鋋氅釧摛瘥騁侴場杈創春棖侘蕆襜垂嘬闖踟勅琤幬椉疇傺澈赤恥滀埫嚓"
  "疾耩畸僅俱計堦珈劼枅將戩楫瞼積圾艦莖期懼竭劔車碁姣虡減莙教犋餕徑擊戛趄檻瞷膙竟價擧鋏寂屆窖鏡岊駕謹躋攫啾今就襉璬雞炯疽鰹磯燼幾橘講獧膠豇淨駃揀記蔣髻鉸頰鼱稭旌蔣僭競侷儘絸劫疌噘錦淺漿翦縉賤鳩倔嚌價罽癤箋婧絹繼澗緝鐝斠具砠禁劇婕君堲焗頸蹷痙焌踘悸殲皆裌拘繭縑家驚囝蜐距弆橛襀孓瘠進繳罝佳苣糨虹箕噱噭漿驚訐極伋舺礁濟祭飢覬玠簡藎捃鮶舊勦牋瘕雞帣墼抉頡腱殣砄霽頰輂紟跲剪柩伽跼解嫉觧稼睛璥悈蕨近巨弳桕兼鮚嚼檻矜葭機珒監獎踖麖戔齊潔睫漖隦鍵謹驕斝槳結京戟靖階擠斤劤桀諫褯經捄撧蛟譾璣菅鞫瞼兢鱂蟣剞揪桷嚌漸檞餃瑾耤賈掘堅咀錦堇駒鯨屨覲嶠齌絕泂居姫濟跡腈踞撟猄狷駿痂疥儁鞠究肌秸劗絳麇沮姜韉魢決餞郊岠簡妗剿垍嘏寖蛺鯽皭濜餞截鬏檟秔繭毽驥嬌劇涓滘袺鶼麂靜久搢菹濺踐珏鹼巹忣嶠狡坰齏厥嫁僦巾燼菁減蒟齊己救盡瀱洚齎緘健爵漸角僥界筠靜鵑韮憬窶鹻脊澽轇精荊燋蟣鷄脛倦舉鴃拮猳咭暨槳洎賮亟薦矍轎強娟紀窶盡掬儉狙踐冏鎵捲絕決璡際佼飢蟭講勥機颶鉏迦戢見儆鈞既糡晙濬獍金捷娵嘉腒薦贐犟呌街覊椐介餃軍崌撿記寯晉嵇楬湨勁薑局肩轎績廄莢桊聚鐧駒刦倞匠赳鋸籛嵴煎藠樛徼剄膲駕警鑒羯屨炬檟潔譏匊癤懼袈接溍醬茳檢腳鳽鰹芰筊筧鵑革戞浹笳菌勁唫鬋舊峻舌岌鬮螿監際技淨鐫穽絹椒鑑厪鍵泃饉齟譾覬跤檢浸唧僬弶躋齎瑨且芨鴂廐脧郟稽加級竫奇楗絜槿傑蹻雋胛校氿羈鰜襟獗拒藉逕酒巠櫛佶苴櫼鐍屩雎炅礆降葰薊湫伎涇桔靳傑粳殭繋汫跡覺濜嶕涇犍珓咎譎姬鮈塈僥噤疆秬驕頸刼跔極倢牮嗟奸窘莖韁笄櫸菊簴竣軍櫃繮坷即濺梜雋蒹鷲膠矯敬蹇妓筋揭畿矩淺孑泇扃鋸僅睊岬堅據酵阱給璟瞿繼痙舉莢車徛珺鞿撿穄枸揀繳挶競蹟韭礆詰衿輯劑彊冀屆箭鋦犄儉嬌忌圈浚蕺乩暕戔姦齏基觭鉀蹴屐踺緊級煚甲給祲喼季岨湔尖俊撅堿浹廑薺誡觖見罥叫迥筥橜鰶絞澆皦恝跽喈假楷蕉榘霽鬮鐻粔節灸筴袷璡集笈靚藎裾劑夾瀽鹼琚諓茄肼皸錈勣鋏棘及鏡螿稉姞鮫計醮艱揃芥奬誡跏急鱭恔禨幾蠲痎嘦駉嘰九將結景枷漈蹐進碣覺靬榤龜鱭磯謇箋郟贐焦晉焆譏韉皎褧吉墐嘰鐫畯鄄勼蛺階梘玖徑捐鞬柬澆輯間玦鉅攟句經艦姐鷦倨訣疚舅詎其睠醵矯賤錤傢叚據件玃津搛僵節蒺鯨緊架蹶惎夾莒逕觔積攪醬噍璣薺檵眷穊劍稷撟梮艱獎激擊間剄挾井趼殲廄櫸鶺毑茭饑臼踽礓朞熲境籍均較钁鱂鑑麕借腳掎劂峧覵刧蚧艽郡劍紀寄交遽擠較崛汲績強敫斚閒戒糾殛瑊傕建晶椾卷偈脛骱江攪龜糾湝爝系"
  "愾喟礦穅曠龕課岢慨檻寬騍煃康睽空剴柯開哐齦顆嵌適眶硜侃坑咯控誑愙誆會胯婫嚳錕鄶悃喀鄺匱擴魁壙哭卡澮纊莰榼嗑抗嘅課膾稞卝夼爌衎睏緙匼塏裉鞚栲悾鵟忼牁考檻戣骷崑塊快揢憒倥瞌窺刳匡崆裩塏剴箜絖窟欬簆筈剋壼盔況敂蝰洘括硿揆瞘蕢闓墾廓筘壙筷髡鏗鞹閌傀佧愷佝曠琨顆埪擖餽豈栞芤褃棵噲愷愒口槺獪坎瞘拷鄺堀犪媿刲闊櫆寇寬廥坤鈧鷇褲可攷壼袴伉凱啃膾礦鱠客圐澮虧垮埳烤肎闚髖會闞潰欿潰庫欵擓簣殼炕騤懇框髠孔凷苦錁吭獪摳崁焢綑珂咖醌挎劻蒯蚵狂愾搕釦扣鱠砢懇堃炌褌軻囥蝌摳彄溘聵鏗絝叩巋嵁咳儈暌昆蔻鶤鎧咵矙苛況閫坷慷堪阬洭侉看寛窾扛闊巋闓塊蒈饋渴氪夸克喹顑蛞髖糠跬隗靠磡噲鐦鍇褲墈瞰鎧肯楷墾尻犒恇逵痾掯科庫貺龕磕筐愧姱凱儈鯤馗呵款轗刊恐胩悝捆恪嚳焜酷殼楛銬跨擴誇鞟戡窠困揩硜奎夔砍尅勘鄶亢炣矻咔枯纊鑛開髁鵾虧頦濶葵栝刻"
  "瀧堎熘鯪欄緉慮瓴圞珕離嘍龍蘞榴烙蠣霛殮爛髏釕梨菻躪鶹籃溜棱癆鰳斂砬荖掄療囹靂鬁漓驢亮檁浬籬埌犖淪黧醁鬑釐坽穭縷霤鱧蒞畧輛雷癘理柃咯奩嫽嶺懶慮寮鹿麟縲倫卵艪剌麐虆蘿魎覽莉鑼臉苓璐鄰厲揦壚癧疁耒矑倫嚦嘹笭陵鬲褸嶁侖橑類壢僂獵臠濾鬎癧屢綝蝲鎌遴琅臨絡瘌蟟錄徠稜嚕撩嘍廊藶嚦李瞵綾詈罱流醨鑼撈濫酹粒巒嚨玲路鎦躐劉轤淶蘢欒潞襤朧浪藍俍蔞礱嘮淚倆癗落曆駱圇蔞剺聯磷綠瓏力猁鰱囉掄覽蘭琳壘盧捋殮祾綸翷鱺舲齡喱儡幱籣隷垏鸕礫篥珋聾祿磖瀘涖墚犛臠魎啦叻騮檁簍髝濂侖僚犖鐒鑾臈艫鐳蘆酈涼朸蠡蘆簍淩癘襝褸漤劣姈艣鸝琉龍爐晾櫪轢葎罹廬論鋶攔嶙邋厤滷塱巒耮饠僇蜊戾鷚糧蘭錸膋臚裸廬輅銠鋝綠鐮陸遛翎禮鏤勒靈耬騾淋聾瘤黎鯉賴姥髎騄邐睩啢麗樓犂煉練嶺聊露煉稑玏蔾鸕櫚鈴櫺鬣漏逯牢辣口欙邐磊趔儽鱸嘮奩醪鷺林漻螻嚨嶗瘻梁髏攏歷良藺哢憭瀏艻濼櫟鴒鏐潦臚螻勞籠裂喇莨硠嫠澇玀桹釐潾糲錸立攏錄欄驪孌靈漊襝灤瞜壢瀾氯戀楞碌爐磏縭壟鞡狸椋褳蠣洛鋰劙鹵襤脟藍弄飀隴癆稂棶臁藶俐闌杝菱輪掠躒陸孿留倞兩腡燎連螂瀏鐮朧礪臘兩瀧呤脷俚櫓畱糲冽蓮梠厲斂鸞嶁慄料遼礱霖另灕梩綸樓瀨凜寥蠊灠瓅纜廖蠟例垃老澇囉邏壘圇襴捩旅領嬾攣鏤櫳裏鸝烺儱埨賚懶鐒璃驘肋量滷傈鎏燐圙瑯鑥浰攔輪櫳蓢鱸磟檑踉菉裡勵欒旯罶癩蒗亷睞鏈鍊徠蘿籬蹽鄰漊顱亂柳躒憐羚聆倆儸凓崚罍狼濾儷鑢槤啉臉盧哩獠愣攣簕酃籃擂瑬雒虜糧崀崍靂曨繚遼鏈萊籟粱懍礪鱲酪齡羅擼昤蕾瘺瀘領纜蘢率啷羅簝楝嫪練崍摟樑礌澪螺臝瘻羸藜麓壟悢蘺腡轤埒輛僂鸞列罏顱萰耮攬藟鋁餾鑞咾嫘蘺隸餎泠囒櫨沴矓簾漣瘰隸鑭連圝蓏佬倮酈勠療籨戀瀝壠硐睖璉欏覙歷犁淪賂魯論欞伶穭鈴灤艫泐鋃勵喨塄履來鐐棃玀獵離郎轆悧棶盭婪讕亂爛樂濫洌駱廩隆礫零壚慄賴靚蜽欖榔崙吏綹利仂吝律臨了擄撈欞礧誄覼婁鯉戮摞硫攬嶗麗籮瑠冷纍令哰諒尥虜凌呂淥聯賃瓈櫟筤拎蛉矓擄曨籙侶啢廉悝臘輬旒躶珞篢廩隴櫪籠邏璘鷯類摟斕痢栳纇烈縷瑓劉樂嫏纑孌萊膦凜淚蓼壈六轢鱺氌涼荔絡箖櫨婁欖漉來簾嵐醽轔儷屢笠睞倈粼蕗匳隣騾淶漋醴勞瀲薐瞭甪鋁濼蠃朗膂耬撂裏褵漯唳瀂籮鑾倈禮賚諒咧閬蠟鎯驪溧虆驢嘞欏澧陋藘娌孿憐簏窿蒞懍鱗累硌纚峛鑪蜋裲琭籙剅匲瀝瓏閭拉癃略蘞"
  "謀捫淼麋瀰霢獏邙甿瑂模冕牟渺溟峚賣泖鸏冥獼濔們糜秒鋩郿咪黽黴眽碼禖貓眸痲眄䥑牧苜勐懋沔蔴麪碼靡尨貿禰蟒劘醚杪摩莽嫫麼苗滿澠每沫瘼茉篾冇黴米寐末沒密祕鰵氂彌懣覔莫歿免卯蠎蜢蘑蠓衇妺名仫閩岷螟麿坶美靦猸脈勱滅蒙麥犛酶母驀鳴瞑謬酕禡厖嘛鰻娒賣榠霢謾沒沬犛門槑矇眠麵夢莓俛滿丏脢麼眳獴鞔鉾猛廟嘧門忞暮麰幎幪饅黽民浼釄暝目茗穆鏌姥帽泌錨罵蔓鎂茂閔木藐熳瞞昧蝐憫謬耱無茅蜜縻茫穈矛沐僶髳命萬默寞萌妹酩袤艨慜漠朦馬滅摸玅燜髦愐抹濛苺貘勱繆毪瑉娩氓瞞螞鍆墨脈幔買芒鏝墁魅宓蟊錳咩馬旄蝥謨牡檬皿袂媒硭呇玫妙糢礳鎂貌摹楣募謐喵汨悶畝蟇眯綿蠛偭鶓冪眊苠禰緬蕒楙蘼瞄洣媄脄邁獁邁緜鉚暋嘸泯顢漫蟎昴孖綿衊鄚慢碈鉧霾惽勔渼幕媚蟎秣邈悶祕嚜獼磨冒煤覓棉蟆麼饝墓勉洺瑪醿甍牻嬤膜楳廟亹蠻蠻銘乜緡謎饅盟冪嗎鶥媽埋鉬敏芼貓陌瞢弭愍皌畝嘸曚懣蕒纆媢抿面貿藦湄罵懵睦湎忙某麻嘿敃鬘槾漭呣鎇鳴耄螞醾嘜們梅謀媽孟曼瑁澠描拇懜姆蝱皃迷靣縵榪蓂牤顢脒茆貊哞饃嵋哶瞀峁慕艋笢鍪羋嫚蛑眉敉痗嗎湣礞魔侔旻眇珉虻買緲霂枚毷盲瞇緍明麥夢無蔑毛沵杧彌璊靺"
  "您孽睨拗吶忸齉儂孃儺饢囁溺濃嬭埝瑙硇蜺乸儗恧躡膿顳紐搦瘧鬧櫱鮎辳撓獰難巎虐糵寧捻儂曩砮傉褭臬腦逆臲隉鎒朒柰年噥廿碾儺膿稬尼輦楠蟯輗兒曖穤濃嶩內糱惄倪嗯麑唸猱顳禰拿黏囔諾牛呢聹訥濘秊涅奴躡膩鈮穠婗苶猊農蹍輾嵲呶泥氖擬醲噥鍩嫋譊耨暖怒唔囁鬧糯暱煗甯旎攆狃囊鼐餒胬鳥黁佴槷獰脲菍尿鈕弩倷納鯰擰霓娜捏能凝紐赧乃納捺恁腩哪娘佞憹嫩柟囝擰禰鑷薴籋囡孼妞攆挐伲鑷抝齧杻艿挪涊那齧婻嬲迺奶釹煖堖喏郳鯰耐衄鈉難嚀孥鎳臑笯聶惱檸女瘧孬蔫拏懦薴萘努內腦釀撚蔦鯢穠喃肭鎿撓奈檸你蝻鬡堖乜褦粘匿淖農衲鐃夒弄薿鳥鐃寧拈惱扭南聹釀廼籹灢擬萳男嚙蟯堄坭耏嚀聶暱峱攮怩吶妮隉駑濘念嫋"
  "毆哦藕謳慪毆鷗謳慪區喔區嘔甌漚嘔嚄偶鷗吽耦噢歐漚歐蕅甌"
  "嗙譬俜斾噴篷蟠膀蜱蹣邳陪醅平蓬氕票紕埔拼淠杷頗滂鈚呸畔胚珀疲匹炮羆旆脬剽刨配嬪芃跑粕舖搒肧啤毘穙葩般薸鋪怕鈹陂否痞坡麅憑品破楩裴踫澼洴乓慓缾丕霹潽甁棚菩瓶脯霶龐啪闝荓噼硼批厖砲猵緶闢怦磻鮍嫖趴咆鬅掱偏鄱胖劈篇鏷釽縹膍羆氆抔樸烹扳坪裨泮湓牌鏺膨盆撲狍派螵琶蹁庀匏嚬殍衃屁槃鰟幈諞蒲溥苉砰片雱磐襻譜轡耙憑帔棑爿磅撲涄脾狉圃鼙裒湃皰盼哌錇濮飄蹼皰帕瞥澎縏頻椑鐠礮埤蹣帡螃迫蚍吡判耪貧玭匍堋坯噴釙僕培駢凴蘋霈肨排嫳胮噗跰鞶曝闢番暴扁鮃朋徬泊瀑榜廹彷苤飃莩悂叵砒瓢泙披葡撇嘭便髈皮蔈伾娉泡罷錍扒鈀姘疋盤堡叛袍筢蟛拋旁淜翩彭癖剖鋬拍屏漂匉賠僻璞掊帊龐媲郫瞟騙拚僕浦奅婆蒎嚭枰逄睥蠙蓱乒評潘普蘋犏玶墣騙桲潑醱顰芘莆攀簰評椪嬪珮榀圮擗噽袢騗潖嘌驃沛笸潑飄捧毗拋甓毰狓僄貧弸皤壞牝酺俳蒱抨蚲魄掽馮陴濼庖仳琵頗胼爬鋪賠佩鉕萍鵬舥醱盤頻碰聘枇貔繁徘"
  "妻梣羥虯寢將琴褰權朐期瓊碁琹闋僉去蹡荃惓箝瓩取趄嗛汧鍥槭瓊郄籤親癯鶖洓禽嵌慼掐騎灈趣嶔磽鍬清請綺錢戧蛐祛齲囚惸淺鰭捦棄鯕鏘芹跂翹謙蘧緝賕悛卡礄膁祁泉髂扦傾沁焌佺疧宭鮨七簽屈篋軀芩芡筇苣氍朅旗驅欽泣潛逡撽榿鉗敲佢欋黔秦訖拤蔃慤闕拳虔伽愜蛆龝砌糗癿肷萩詮矜闃炔瑲溱球駸璩牽齊荍蹊鰁槍前楸輇鏹迄恰磬輕蜞慬犰慶檎踥乾搉萋拑蛣蘄魌汔諐劁嗆塹嶇籧嶠胊鉗搶阡麒覻撳鉛俏蹌攲岐麇裘愆芎豈勸誚榷趨剠臍棲弮蕖遒丘寢棋蕎熗潛鼩擒碻愜戌逑顴豈親騎嶠牆沏鋟埼軀詘齊躈虯柒吢勸圻泅磲帩邛屺蕁愨仟竘羣嶇亟僑峭搴企強卻僑麯鼽葜竊銓氣確棨牽遷墻廎磏杞鬈唚綮撬挈瑲竅祈藭綪鈐瘸煢蕁筌欺噙橇醛戚塙戕啓券勍窮鵲殼籤歧悽悄慊錢槧鞽呇鉛頃蹌乞俟臍鰌怯侵憩磧芪區愭薔碃蜷騫頎喬噐幧鞽羣臞鏚鬐葺淒覷繾趨偢杄汽磽芑衢棬陗佉嬙且麴麴嗪稽奇蠼氫蹻嬙晴啟篋區訄確穹卻缺漆鯖鵲懃湫罄凊畦譴螓翹郪鵮犍碶帬囷琪蘄煢曲悽棄坵仇炁巰鎗譴檾鸜蚯淺欹羌倩樵銎俔芍袪瞿蜣戧求瑔槍妾玘請襁胠搶橋艢黥嗆彊切僉銶蒨竅圈渠洽裙愨黢檠鞧璆蜻巰憇錆岨竊痊栔廑薺覰鴝慶勤掮踡鞦衾起檣蕉青圲蝤蹺欽喬袷圊鰍茄繰腔蠐千謙萁蕎坥卿娶歉邱穐婍檣啓榿祺跫耆熗器箐愀將粬婘靬棊鍫龜畎氫藑殻頃琦韆藒擎墝殼敺祇薔酋搇秌輕其蹺碕遷鏘苘灊桼騏旂嘁窮埆繦綣縴薺犬覃氰棲謦契劬巧橋驅情吣秋羥錡權麕遣蛩碏綦牆茜墘亓慳顦斨強蟿譙崎全岍釺傾孅欠淇毬鍬蠐磜慳瞧氣芊俅礄纖龜憔雀鞘"
  "榕肉鎔鞣饒餁嬈蠑鄏容鎔蝡燃軔壤仍然熔髥茹蕘蕊蕤閏嬈入髯瀼染嶸嶸芮冉蚺熱繠宂篛兒若洳冗扔偌儴蒻壖辱銳牣苒榮禳訒乳銣媆糅葚襦軟惹橈濡薷壬蕘冄婼攘潤蠑仁衽箬擾熱蹂勷肜爇蚋袵蠕耎認銳蕋茸蜹絨稔蘘蓉軟任妊靭刃恁鄀嚷韌蓐潤蕠弱褥紝阮狨融儒饒羢飪睿喏氄焫擾瞤讓人擩日瓀朊輭葇兒叒煣汝挼紉瑞認馹溽瑢瓤嬬繞榮緌絨叡孺讓繞蘂戎橈絍縟穰枘汭刄礽荏韌仞蚦溶姙堧忍如橤嚅柔顬揉"
  "艘靸笥飼鎪仨蘇肅楒鏁璅叜祟猻佀擻簑颸睃螄廋俟厶頌嗾膆緦澀虒糝眭凇簌廝溲食巳頌算叟僧粟梭覗嵩傃宿瑣卅璲嗇碎筍祀穗訴濉繐榫訟脎愬嵗蒐洓薩姒肅囌訴賽繰遡散蒜瑟隋嗉氉霰祘喪鍶銫孫涘塞汜觫揌蓀慫俗溯聳歳饊噝歲廁穡鷫毸娀鷥死酸司色慫四葰絲噝嗣隧掃窣藪穌桫颼孫泝糝嗦璱雖損涑罳襚嫂腮尿搜驌荽聳餿摋蓀梢耜思溞傘甦縮塑廁嗖泗挲肆髞撕筭送噻擻鎖顙蹜鰓絲毿灑私臊訟瑣穟旞所飼鬆邃猻挱損悚飧薩綏弎叄驌羧竦毿嘶嗍斯狻莎菘嗽娑磉澁三穡颯埽隨雖澌餗凘僳已唆嗓縮蓑螋蘇溹駟謖灑遂鷥繅似搡瘙鎖隨搔瞍素酥鬆簨寺誶鄋顋澀淞森愫蜙嗇嗩夙騷誦撒浽燧歲濇宋痠忪索伺偲速桑喪飤賽竢廝兕掃鷫睢螄禩藪潵誦蔌傘繖筍隼髓飱崧"
  "貪穜調橐畋盷退螣條燾梃珽藤啕炱厛塘攤梯砣擿鞉餳態忒酴添甜町蘀錟套殄體跳梌蟘膧題廷莛齠剃湉怙恬縢題曇捅迯團鄌態趿僮淘踏厗褪體煓佟灘慟沺囤儓眺濤摶闥屠搯螳柝圖脦籜岹闐撻貪鴕頲岧逖咷駝峂橢鐋闥隤佗蓨談烶堍跆突嘆蹏迢禿墖倘茼帑嗁酮沱靦躺侗嘽廳鼉燙拕抬綯淟檀謄鮷脡團屜靸飥太特籐銅獺韜嚃碳庭仝溚湍漙綈銕廳銻蜓匋坨絛榃屜絛臀枱跎鯷斢澾她躰陶陁堶塔烴魨滕忑炭苔鼗討烔推唾叨溻朓鞓忳涕同圢黇土萜鬌桐騠掭晪鞳鐋糶脫恫螗鐔滔疃汀榻壇踢鰷菟肽停鐵提唐坍豘彖桯霆敨垌脫澹堤婾燂侂猯縧弢膛棠筩橢掏魋籜遢陀撻蘀攤汰渟吐鶗貼洟桶笤鈿跅鰨邰惝田嗵圫曈剔聽儻它嘽烴牠氽乇遝兔闒熥條透醄哃潭啼焞佃駘堆赯筒填趟聽祧堂萄沓天鉭嘡圖倜託蹋鮐腿稌鞀毯菼緹蛻鼉痰挺艇侻饕摶聼婷羰璮談鵜慟途吞裼銅窕糖臺趯壜逃鼟怹搪酡洞禿鏜妥餳拖逷探俶蓚鼧魠檯忐投騰凃餹鮦馱瑱呫髫墰畠溏歎呔弟鷉癱煺飩屯託譚統菾蹄擡餮穨鋱荑庹貼釷蹚尵駝奤頭鯈磹樘鰷瞳耥塗腆侹替颱砼慝鈦彈馱罈覥仛糶薙罎拓淌嬥騰嚏壇臺韜瑭坦峒鐵圕疼钂葖調儻慆暾湯畑鈄駞豚嗒彈忝縚徒檮兎頭褟塌餂亭骰衕嘆灘糰舔搨彤篖钂頹塗遆洮鋌瑅童燾通坉挑倓潼曇薹槖瘏酞濤燙橦討鉈䃮覃挩魄痌癱柁荼謄泰悌漯郯他袒桃胎凸惔腯醣葶嵞醰惕醍苕兲湯檮佻統偷痛蜩脁埫帖"
  "姝瀧試嶦鎩螫篩繩釋瘦蝨菽勺睒柵懾蜀蒴腎虵雙腨燊師刷匙侍塒杉揲捎溼豕毹歙適腧饍說峙識礵苫山噓燒鄃葚商淑屍拭娠殳豎笙獅折呻視芟傷栓逝貰牲奭倐贖鐥恕薯熵疎贖塽數摋梢禪數疝夀歃挲涉吮嬸審嗜昰鉥甩試聖蝕屬跚驦溮屬澠湜閃稅唰召羶糬士鯊澨深駛竪蜃孰紳鰤剎帥擅艄甚痁闍壽佘市傻雙爍蒔誓戍蝨殺昚身輸單尗獸乘摔省傷使刪襫瘮師栻舐摻奢鸘參葹樞剎儵懾時衫垧暑舢矢賞騻神麝韶澍攄鎩椹狩首示適儍鳲甥孀壽蛸說鿃順珊姍勢捨鱓啥蟮蓍色媞搠癙駪鰺糝舒矟稍紹烻裟贍裳裋觴庶潲射飾炻書陎讅勝瀋尚審玿陝水埏挱痧邵珅瀋剩鈰豎蟀慴篩失艏順訕紳俞聲盛哨殖漱事廈社飾室滲疏祏獅石諡詩曬辻朔殊嬸柹鑠恃鰣設廈卋瀧沭鼫眘書收槊勢獸糝卲氏食舌燒繩沈誰釃鰣聖式豉十始秫什柖世紓砷藷厙溼鰺駛睡樹嵊輋邿灄赸峕蓡屎釋鼠墠觴騸閂蔬剡慎紗隃涮舍扇爽鯴晟掞署實勝叔伸陝稅妁筮紹拾羶殤樹善柿砂率墡衰姍霎抒芍汕識鑠綬溮晌熟倏墅諗柵碩屾箑塒嗄誰湦授赦詩升釃視漴釤昇施手曙莘攝黍沙爍収攄帨仕閃畬唼賞嬗哂畲單少弒鱔瞫屍撣鞝墒詵撣瞬潸霜攝耆帥眚鷞鄯棽滲湯束煞守諡澠籸灄腎塾杓甡梳耍賸賒輸絁史猞申寔殤煽曬禪侁生婌陞膳莎噬搧樞矧劭設殺筲受是刪摻似帹參上紗述胂濕蝕鞝舜蛇楯蒔時軾睄術苕實朮湯澘拴葠聲瘮椉繕術售鞘晱"
  "黰榛酎嶦杼穜査螫椥浞皻鍾倬誅窄甃柵竚找榨紙砦章僎脹揸蟄鄭紾滯鄣住冢咒吒擿瘈琢醡拃傳貯譔值痣椎酖痄峙氊識兆宙終盞脹帋縝砧錣蒸漳燭忮櫫照獉禛茱終折睜磔跂止着彰瘴蟑縐僮遮赭帳紂瞻致樁卓籀繇齋祗證豸枝詐搩炷疰湞椆膣診擇咮嶄繳債屬渚鑄屬戇哳註鍺正賑摺緻寨筯召準晊碡鎮祭礃沚襵飦漲莊卮專築枕樟伷霅髽諑諸壯鍾哲墜喌鍼茽陳指漲砟芷週溱閘誌志趙丁齊盅詝囑長州粧制趙粥妯窒鮓瘃沼甄檛呪衹盩狀黹鑕迍張叕濁支鍾忠鷓灼胄簻胝諸矚蝃縶肇朱墜桎賺佔軹中脂禚摣椹軫塜蹠震捉躅宅摘塼讁箒張乍笊晫餦準篆輾狀這甽騭針厔側綴炙賬鱣蛛贄招贄箏銖撾嶄梲瀦鑕踵閘陣狾戰執幟摯轍樝挓紵咫炸躑葤輙淛置舯爪葴輊搾紮躑甴喳汋袠譸眾肈膇仉篹只鷙鵃製圳觶砫腫幛查崢嘲侏廌周執洙肫偵驟籑摭詔鱵彸柘撰妝栴植餷傳鎮賙振殖站溠鷙跱豬綻擇讋礩質蚛曌蘵柊撾旃雉柱鐲隻癥智譫佇駐浙渣帚囀這埻侜鬇紖氏苧棹診注氈洲掙嗻枳稙烝璋妝櫂壯證陟顫追謅窀衆滍睜珠蘸皺啫竹長札擢織整鄭褚躓眨賺穉掙鍘珍輒裝譸梔蟄蹠貯樁麈寘逐針櫛蔗晢仗朕陣鯖仲展祉啁邾斫斸櫧磚斲讋邅婤偵鷟沾織牐梽斟稚疹晝泜祝職帳扺隹猘姪晣真蜇輈楂拯帙蛀皺惴氈腫硃蓁爭鱆証址政棧滯胗煠喆識竺冑啄賙怔醊裝痔齋偡苲至躓饌柷重謫瑱呫螽株紥詹之柵颭衆耑吒畛茋徵椓築屯佇黵桌奘觶紵舟貞碪鬒琖縶囀酯斮昭斬瑧旐湛瑑漴稹柞梔種嶂者芝鸇知涿燭拽疐翥肘顓鮡埴掌旨酌職櫛搌障珎爭蛭瘵焯麞紙彘肢綴銍幟朝濯縋錐鋜專伀徵舳衷駐諍擲賬鮺矚著箸種騅茁膞揕蹢幢佔症楨杖箴掫鑄衠驟轉吱禎郅縐祇磚軸霑袗釗鴆嫜蚱炤鉦趾錚盞饘獐贅擲芧治奓劚榰沌拄秩猙咋豬諄謅債棧巵直助甎翟櫫幀鐘齇莊庤抓戰囑阯瀦蠋紩濁粘晝摯恉蠟轉昣忪質劄主暲爆僽喋拙撞禔丈煮侄臻褶軸畤蜘罩術汁跩扎軋"
  "喂琬罻蜿鋙螱葳蛙斡瞈緯痿娃忨蕹謂闈誣煨韙忘隖渦嵬椀萎襪廆鼃烏惋猥汶違巍湋幄萬聞葦甕頠唔伍蝸梧窪襪葦洧娓幃煒諉菀榲誤汪滃蕪違坬蓊惡慰逶屋偉媧緯蕪壪芄王韋維萵兀炆啎問暐痏婺誤輞椳韡珸鶲韙隈物渦洈畖蜈塕忤危偽溈渭凹偉齷豱挖喔薀翫衛旺完尾嫵蝟遺圬杌迕肟歪蝛鮠晤轀鎢玟位亾躗五穩污刓吻尢闈窪硊臥蔓碗嗡玩撾腕桅煒無甕鼯瘟佤嗚倭涴廡瓦璺紋萬為頑瑋汙潿扤屼騖喎勿烷鶩峗亡韤娩盌韋鰮莞灣芒踒阢渥蝸巫挽撾鎢牾悞餧僞我網萵務微霧妄哇戊舞翁脗皖螉窩惘壪網幃鮪骫誣偎憮煟剜罔爲毋鄔輓汚畏僞塢蔿雯務捂畹齆沃衛鰃寤婉潙崴抏謂紈焐脘晚握溫蒍潙芴豌委抆鄔外䲁彎鵐亹窊爲魏未浯薳惡汍鋈蚊暡宛痦霧溦揻於嫵邷蝄午威嘸鵡隗搵塭靰紋碨妧紊尪婠潿罋旿濰嗚硪唯吳膃磑味烏霨磑碔薇廡琟俉丸胃窩衞圩維圍尉餵刎偓杇帵魍武郚塢讏灣問珷頑蝟蔚帷侮潕惟吾文蟁吳摀芠仵臥瑋憮峿洿聞往卼溫彎澫媧娬穩穵無悟艉閿枉圍綰望"
  "餡淆倖蟢協鹹褻訊陿岫響潟踅翈歗糈杴淅梟咻銷冔燻楔郋蝦姁縣禤諼琄鋅榍勰豨卹絢絃邢霰歙餳譆鮮烜霄效錟猇鷳蠵絏緗歘兇葸漵噓矽孝忻忷瀟璽虛褏勗吸饈馴燹瓖詳唏席選鬚性盻膝滎豀喧廵幰響醯靴序噀鬩硍塮餡滎休恓蓿西鴞蛵詗祥瑆學烯霫邪噱壻鞵爔尋蟋哮貅潯薟戱轄鍁暄線祫湑頡炫晅莧躚蠏解獫揎繡嶲小獮向鉶旋狥隙嬃璇鼷纖暿皙徇訩鱘詢驍翔泄傚珣繡許嗅晛缿蹊饗晰瘜些窨襭澥敘媳咲毨箱蓆擤魆巽暶省褎秀鮮譞昕炘脇胷續盨錫餼象薢希循崤恂脅險鱮賢茓選儇峋擕喜獯形消鷳獬曉悉鈃雪莕心敍媟攜舝嶍鉨柙羨潠芎脩葙狹棲嶨狹舷鉉餏廂蛸尟杏朽洨瀉砉蜆薰勖琇像嫌戌習辛汐橡續谿粞訓翕熺梟隰雄庥觿痃蕭蕈珛相瀉筅醒湘險訢焮晳享鑲俠懁灺諧玄匣羲銷現餉羞戲饗葷嫺鄉薟賉析熙鐔煖許蝑徯蘐憙髤息徐迅謏溴行項釐鯗協垿鑲欷萱癬蟹瑄咺弦屧洶魈見濬罅奚硝羨榭先腥廨洫廈眩潯血衖蘚陘簫恤鏇徙睎胥纁斜匈驍習褻惺嚻賢陷晞盱啣蕁栩伈憲昡詳唬笑汛券禧薛歔懸躞嬛箲細恟騂廈詢璽葉線綌擷璕芯尋尠銜驤脅筊憲噓軒嬉硤酅屑郗陘郇蝦渫秈詡兇煊銜犧哅銑溪楦邂戲下嘯襲峽想嶮蕭袖傒訊顯婞齘筱需俠暹絜蠍撏鱈犧校偕硤係蓰昫臭纈鰼鏽郤絢栒現降墟新穴薌撏磎嘯削顯俙渲繫舾兄銗煋熊籲鯗遜旬觽嘻揳嶰興裼熹虩紃禒惜襲蠨狎跣偰婿檄嶮菥巇顖鮭緒型碹縣髹餳囂廂須襄歆癇蓄玹炧窸掀謝咥勳禊逍挾鉉嚇殽攜斅興欻禼姓鄉須祆歇蜥修峽燻僖浚浠餼鰕囟燮虓虛珝遜陜隟曛篠洶屓熄械獻學螅氙蠨躚莘見屟鱏鑫僊鎋瑕効洗釁霞鱘宿荇泫瀣魖舋鋅獮肸馨煦蠍寫秈謔肖訏嚇悻閑瀟稀翾壎覡刑鵂斈鬩嘵懈寫信巷涍硒愃峴玁欣線敘薪屣胸洩緤樨項謝穸細鱚卨緒頊癇噚獻鹹圩絮臘暇鞋硎旭瞎壎伭黠箵洵畜嶨旴夐遐斆叚嘵冼兮熻灑鏽舄薌衒星香巡訓屭璿綫芧呷枵鄩銛滫勳滧懸珦詾挾契鞾簫皛噏曉爕酗紲腺幸荀酰仙漩嚮卸宵夕涎夏嫺殉楥曦獫猩娭滸鶱宣昔釁庠茜犀薤閒忺枲閒孅纚諝錫綃醑醺限滀纖卌翛曏系"
  "雅鹽鋙覎呎傭馧鑰銪窯喑薁螢椅喭弈堐縯黶冘藝禕鴛輿蝓貽瀅耘嫄氳吆飲夭螘宥戉瑒尹醃茵揚甬亞寅潁矣鋣伃讞熠虞慵璵語鴉御艤弋營蝣椸厭苅燁齦傭爗菸籰雝嗌婣墕譯說優耶禋以瑀醫迆瑜枻巖鉞俁啞萮繄囈鷁運娛袎茚義蘊愉演麀蜒圯胰芋樾鶃籲嵒言曳垣媖謁揠勻應唷滎霙噫椏槱潏瘖夤儼贏怏聿妘緣贗硍嚶繇隱貐悒預鶯鴦滎鞅園菀邑驛淊暘引鮨踦閻洇湲韞琰圜敭鷃堉麼諭謠苢伢邪嚥咬釅沅鼴鄆鷹藝慾迂靷懨芽籥翊昱吟鷂螈倚野約醫鴳屹玡幺痍眙鄞儼雩埡牖喲悠玥翌鼬箷筵廙鯒鍚鮋嶧園湮蓺意裕籝絪油閼瘞閱鴈壹纓壓陽隅顒倻鵒弌郢月嶷駰佚漪訑釉憖雲藥腴閾瑤遊窨崖嬰愈揶易猶壅圓粥嶢囿癮淵揚萸埸曄咽鬱娛妍懌毓友異銥猷龑厴溳咉饐贇魊越圄驗蟻閆闉肄埜遠羽英儀喁曜罃囈殀宇勩慇墉有嬴鸚窳遇又楊幽躍兗尾鄖遺訝恿瀠礜猿癰蛜姚烊螠圓灧釅昀淯蚴鱅憂焰懨樣遙掗栧議燄瘀氧狖癢籯攖郵仰檐鴨瑩贗垟嫗蟫颺幼枒庽鹽尢陶蕓檃亱噦喻盈裛迻湧漁瀠潩蜎啢咿億鄢雍軋韻狳鷸歟癮罨峪煬簷陽唁譽巘刖蚖羊鈺喓猺秧齬烻踴甗觺浥矞悅僥鄴筠佑渰龠圻訝漹昳漾願砑傜踊仡嚚醞喲黝遙硏馭偊涴眼薏閱殪呦與櫟癔鈾氬瞖醞宜詠璵姻膺庾鎣饜院黿腰役燁驛玗詑垸焉苡譯艤迓禺谷姸彠泆予厴豔隱寱議偃鵶澐彥臙疣藥醃窬溵蔭掖焱衣嫗瀅原鷰俞鴨逸嬿蔭應澐顗斿崟罭液嶪椰媱蜮諺煬諛羿踰蝘佯陰疫濚宴癰要堙蕕蠅崯養瑒婭韻夷爻樣傴崕飴鷹婭楪黟蛾鶂宧俑熒嶢臃葉羑爺餚猗袁魷鉛詒堰用鳽塋魘瘍轅擁爓顏吖瘧唫食貤搖讞印遊泱暈誾勻餘硯圫虤鬱乙褕嶽嶽佁輿乂塋延姨熅怡衍懮挹啞餘逾圉枍澭也獄亞媵塬罌猶抑鎣鍈箢卣魣悆一軼祐陰杳埇熨垚彜央瘍涯瘐蚓厭氬翼齮燚渝源窅熒咦掩杙獄魚語奄飲恙鏞異誼慂紆棫勇珢壄餘剡扊縕雁酉溢銚瘂詣臆沇沿嬰映慍猰胭縈鄘瑗紜亦籲邘歈豔僥鄾掞舀彝廕夜揜哩禹睚瀹呀晻疋業淹爺寓嶼鄴窈狺鸑釔婬媛悅湧黦丫誘硬閹邀霪暆癭曰銀預漁與鐿欹揘垠噦影怨櫞艷懕鷊琊醼曱篔爚益艾靨齗黿儀螢歟鋆刈銀毅曄嶧冤豫瑛饜宛瑩玉暎窰欲蠅鍚穎弇於眢螾譽隂嗈鴥耀業籆禦繹芫酏荑扅驗堨淤爰窯頁髃暈椏郵靿魘徭埡甖義堯寃嘢懌拽殃煜燠誼畬嫛嶼葉珧蘡牙優畲妧泳櫻憖緣匜縊頁掾毉樂依員蝤魚押禕憶衏右颺黶櫽裀員佾域洢噰銦約蟻吋鑰濙齩耰蚰劓愚柚搖閆詠殗輶殷援軏壓蛹嚴邕由戭吚顏憶噎瓔舁裔覦曀繹鷖靨櫟鰩誘瘉掗因彧郾饁讛蚜庸燕彠粵揖啢嵎譍鶯鸎養煙營沂巖榆蜴讔尉元懿肊扆暘厓蘊鴉侑伊苑音躍愔澦鈾鬻樂敔讌抴猨瀛岈嵛臾惲穎煙妤跀莜蠮奕垽謠餚韞研冶浟尤憂畇蔚軺鵷歅癢竽滧雲迎願億孕瘧氤已晏胤燿燏鎰栐擁遹盂縈旖蕕移簃妖淫棪雨淵齵瘂騐衙遠隕飫徉嫣疑崦殞羕揄灩肬蛇嚴鼴允芸檥楹於育揅峿瘞癒阽隩蛘暍羱運炎莠腋攸傴艅鳶浴狁楊蕷嫕鄅崾抈吲頤堯唈颻旟迤洋饔遺永翳矱軋"
  "諮瓚譟慥宰嶟舴昝賾髒族最崽柞烖蹔咂崪騣坐竈燥賊秭暫葄璪檇葅宗蹤眥租罾纘剚咀珇桚阼諏組子襍祖趲攢載詛奏淄資儹昨賺倳齱縂琢暫偺嘴鯔孜組責籽緅帀茈鄫駔尊嘖脧栽繒走雜躦堆總澤總鄹鏨怎祚簪鬃匝茲贈矰訾菹簉鄒槜讚曾晬蚤僔諮唑嵫側皁在崒糟阻梓篸攥纂啙棕載災辠佐則虸呰趦糉樅郰作孖臢俎造撙縱紫儎騌滋姊罇吱菑足竈縱澡寁茲早胙咱腙鄑漬樽笫胔孳蹤陬鯫簀綜鬷觜擇耔賊迮遭瘲賛贜紮粢雜臧鏃攢緇鼒贊贊澤拶噂撮騶鋥左棗皁喒牂篹齜座增牸咋責昃捘酢岞滓諮臟酇鑿倧貲笮自鰂籑齚椶鄒怍罪眥災藻憎樅字騶簀摠藏躁鑽呲糌仄贓資鑽胾噆捽捴綜擇醉甑髭贓譖紥糉再嗞揍齰蕞幘嘬做鱒卒筰輜唣恣噪趑遵錙仔砸葬姿髒鑿則傯哉奘甾瘲棗蹧傯鎡扎灒"
))
;;; DICT ENDS HERE

(defvar pinyinlib--punctuation-alist
  '((?. . "[。.]")
    (?, . "[，,]")
    (?? . "[？?]")
    (?: . "[：:]")
    (?! . "[！!]")
    (?\; . "[；;]")
    (?\\ . "[、\\]")
    (?\( . "[（(]")
    (?\) . "[）)]")
    (?\< . "[《<]")
    (?\> . "[》>]")
    (?~ . "[～~]")
    (?\' . "[‘’「」']")
    (?\" . "[“”『』\"]")
    (?* . "[×*]")
    (?$ . "[￥$]")))

(defun pinyinlib-build-regexp-char
    (char &optional no-punc-p tranditional-p only-chinese-p mixed-p)
  (let ((diff (- char ?a))
        regexp)
    (if (or (>= diff 26) (< diff 0))
        (or (and (not no-punc-p)
                 (assoc-default
                  char
                  pinyinlib--punctuation-alist))
            (regexp-quote (string char)))
      (setq regexp
            (if mixed-p
                (concat (nth diff pinyinlib--traditional-char-table)
                        (nth diff pinyinlib--simplified-char-table))
              (nth diff
                   (if tranditional-p
                       pinyinlib--traditional-char-table
                     pinyinlib--simplified-char-table))))
      (if only-chinese-p
          (if (string= regexp "")
              regexp
            (format "[%s]" regexp))
        (format "[%c%s]" char
                regexp)))))

(defun pinyinlib-build-regexp-string
    (str &optional no-punc-p tranditional-p only-chinese-p mixed-p)
  (mapconcat (lambda (c) (pinyinlib-build-regexp-char
                      c no-punc-p tranditional-p only-chinese-p mixed-p))
             str
             ""))

(provide 'pinyinlib)
;;; pinyinlib.el ends here
